wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
/*!
    \file    gd32g5x3_hrtimer.c
    \brief   HRTIMER driver

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32g5x3_hrtimer.h"

/* HRTIMER related parameter mask */
#define CNTCKDIV2_0_MASK (uint32_t)(0x00000007)
#define STX_UPDATESOURCE_MASK0_5 (HRTIMER_STXCTL0_UPBST0 | HRTIMER_STXCTL0_UPBST1 | HRTIMER_STXCTL0_UPBST2 | HRTIMER_STXCTL0_UPBST3 | HRTIMER_STXCTL0_UPBST4 | HRTIMER_STXCTL0_UPBST5 | HRTIMER_STXCTL0_UPBMT)
#define STX_UPDATESOURCE_MASK6_7 (HRTIMER_STXACTL_UPBST6 | HRTIMER_STXACTL_UPBST7)
#define STX_FAULTCH_MASK (HRTIMER_STXFLTCTL_FLT0EN | HRTIMER_STXFLTCTL_FLT1EN | HRTIMER_STXFLTCTL_FLT2EN | HRTIMER_STXFLTCTL_FLT3EN | HRTIMER_STXFLTCTL_FLT4EN| HRTIMER_STXFLTCTL_FLT5EN| HRTIMER_STXFLTCTL_FLT6EN| HRTIMER_STXFLTCTL_FLT7EN)

/* configure Master_TIMER timer base */
static void master_timer_base_config(uint32_t hrtimer_periph, hrtimer_baseinit_parameter_struct* master_baseinit);
/* configure Master_TIMER in waveform mode  */
static void master_timer_waveform_config(uint32_t hrtimer_periph, hrtimer_timerinit_parameter_struct * master_timerinit);
/* configure Slave_TIMER timer base */
static void slave_timer_base_config(uint32_t hrtimer_periph, uint32_t slave_id, hrtimer_baseinit_parameter_struct* slave_baseinit);
/* configure Slave_TIMER in waveform mode  */
static void slave_timer_waveform_config(uint32_t hrtimer_periph, uint32_t slave_id, hrtimer_timerinit_parameter_struct * slave_timerinit);
/* configure the an external event channel */
static void external_event_config(uint32_t hrtimer_periph, uint32_t event_id, hrtimer_exeventcfg_parameter_struct* eventcfg);
/* configure the channel output  */
static void channel_output_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel, hrtimer_channel_outputcfg_parameter_struct * outcfg);

/*!
    \brief      deinit a HRTIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[out] none
    \retval     none
*/
void hrtimer_deinit(uint32_t hrtimer_periph)
{
    switch(hrtimer_periph){
    case HRTIMER0:
        /* reset HRTIMER0 */
        rcu_periph_reset_enable(RCU_HRTIMERRST);
        rcu_periph_reset_disable(RCU_HRTIMERRST);
        break;
    default:
    break;
    }
}

/*!
    \brief      configure and start DLL calibration
                Note: DLL calibration is valid only when the system clock frequency is between 150MHz and 216MHz.
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  calform: specify the calibration form
                only one can be selected which is shown as below:
      \arg          HRTIMER_CALIBRATION_ONCE: DLL calibration start once
      \arg          HRTIMER_CALIBRATION_1048576_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 1048576 * tHRTIMER_CK
      \arg          HRTIMER_CALIBRATION_131072_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 131072  * tHRTIMER_CK
      \arg          HRTIMER_CALIBRATION_16384_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 16384  * tHRTIMER_CK
      \arg          HRTIMER_CALIBRATION_2048_PERIOD: DLL periodic calibration, the length of the DLL calibration cycle is 2048 * tHRTIMER_CK
    \param[out] none
    \retval     none
*/
void hrtimer_dll_calibration_start(uint32_t hrtimer_periph, uint32_t calform)
{
    uint32_t dllcctl_reg;

    /* configure DLL calibration */
    dllcctl_reg = HRTIMER_DLLCCTL(hrtimer_periph);
  
    if (HRTIMER_CALIBRATION_ONCE == calform){
        /* DLL periodic calibration disable */
        dllcctl_reg &= ~(HRTIMER_DLLCCTL_CLBPEREN);
        dllcctl_reg |= HRTIMER_DLLCCTL_CLBSTRT;
    }else{
        /* DLL periodic calibration enable */
        dllcctl_reg &= ~(HRTIMER_DLLCCTL_CLBPER | HRTIMER_DLLCCTL_CLBSTRT);
        dllcctl_reg |= (calform | HRTIMER_DLLCCTL_CLBPEREN);
    }
    
    HRTIMER_DLLCCTL(hrtimer_periph) = dllcctl_reg;
}

/*!
    \brief      initialize HRTIMER time base parameters struct with a default value 
    \param[in]  baseinit: HRTIMER time base parameters struct
    \param[out] none
    \retval     none
*/
void hrtimer_baseinit_struct_para_init(hrtimer_baseinit_parameter_struct* baseinit)
{
    baseinit->counter_mode = HRTIMER_COUNTER_MODE_SINGLEPULSE;
    baseinit->period = 0xFFDFU;
    baseinit->prescaler = HRTIMER_PRESCALER_MUL32;
    baseinit->counterdirection = HRTIMER_COUNTER_UP;
    baseinit->repetitioncounter = 0x00U;
}

/*!
    \brief      initialize Master_TIMER and Slave_TIMER timerbase 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  baseinit: HRTIMER time base parameters struct
                  period: period value, min value: 3*tHRTIMER_CK clock, max value: 0xFFFF �C (1*tHRTIMER_CK)
                  repetitioncounter: the counter repetition value, 0x00~0xFF
                  prescaler: HRTIMER_PRESCALER_MULy(y=32,16,8,4,2), HRTIMER_PRESCALER_DIVy(y=1,2,4)
                  counter_mode: HRTIMER_COUNTER_MODE_CONTINOUS, HRTIMER_COUNTER_MODE_SINGLEPULSE, HRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE
                  counterdirection: HRTIMER_COUNTER_UP,HRTIMER_COUNTER_CENTER_ALIGNED
    \param[out] none
    \retval     none
*/
void hrtimer_timers_base_init(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_baseinit_parameter_struct* baseinit)
{
    if(HRTIMER_MASTER_TIMER == timer_id)
    {
        /* configure Master_TIMER timer base */
        master_timer_base_config(hrtimer_periph, baseinit);
    }else{
        /* configure Slave_TIMER timer base */
        slave_timer_base_config(hrtimer_periph, timer_id, baseinit);
    }
}

/*!
    \brief      enable a counter
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  cntid: specify the counter to configure
                only one can be selected which is shown as below:
      \arg          HRTIMER_MT_COUNTER: the counter of Master_TIMER
      \arg          HRTIMER_ST0_COUNTER: the counter of Slave_TIMER0
      \arg          HRTIMER_ST1_COUNTER: the counter of Slave_TIMER1
      \arg          HRTIMER_ST2_COUNTER: the counter of Slave_TIMER2
      \arg          HRTIMER_ST3_COUNTER: the counter of Slave_TIMER3
      \arg          HRTIMER_ST4_COUNTER: the counter of Slave_TIMER4
      \arg          HRTIMER_ST5_COUNTER: the counter of Slave_TIMER5
      \arg          HRTIMER_ST6_COUNTER: the counter of Slave_TIMER6
      \arg          HRTIMER_ST7_COUNTER: the counter of Slave_TIMER7
    \param[out] none
    \retval     none
*/
void hrtimer_timers_counter_enable(uint32_t hrtimer_periph, uint32_t cntid)
{
    HRTIMER_MTCTL0(hrtimer_periph) |= cntid;
}

/*!
    \brief      disable a counter
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  cntid: specify the counter to configure
                only one can be selected which is shown as below:
      \arg          HRTIMER_MT_COUNTER: the counter of Master_TIMER
      \arg          HRTIMER_ST0_COUNTER: the counter of Slave_TIMER0 
      \arg          HRTIMER_ST1_COUNTER: the counter of Slave_TIMER1 
      \arg          HRTIMER_ST2_COUNTER: the counter of Slave_TIMER2 
      \arg          HRTIMER_ST3_COUNTER: the counter of Slave_TIMER3 
      \arg          HRTIMER_ST4_COUNTER: the counter of Slave_TIMER4 
      \arg          HRTIMER_ST5_COUNTER: the counter of Slave_TIMER5 
      \arg          HRTIMER_ST6_COUNTER: the counter of Slave_TIMER6 
      \arg          HRTIMER_ST7_COUNTER: the counter of Slave_TIMER7 
    \param[out] none
    \retval     none
*/
void hrtimer_timers_counter_disable(uint32_t hrtimer_periph, uint32_t cntid)
{
    HRTIMER_MTCTL0(hrtimer_periph) &= ~(cntid);
}

/*!
    \brief      enable the Master_TIMER or Slave_TIMER update event
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_timers_update_event_enable(uint32_t hrtimer_periph, uint32_t timer_id)
{
    switch(timer_id)
    {
        case HRTIMER_MASTER_TIMER:
            /* enable the Master_TIMER update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_MTUPDIS;
        break;
        case HRTIMER_SLAVE_TIMER0:
            /* enable the Slave_TIMER0 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST0UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER1:
            /* enable the Slave_TIMER1 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST1UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER2:
            /* enable the Slave_TIMER2 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST2UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER3:
            /* enable the Slave_TIMER3 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST3UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER4:
            /* enable the Slave_TIMER4 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST4UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER5:
            /* enable the Slave_TIMER5 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST5UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER6:
            /* enable the Slave_TIMER6 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST6UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER7:
            /* enable the Slave_TIMER7 update event */
            HRTIMER_CTL0(hrtimer_periph) &= ~HRTIMER_CTL0_ST7UPDIS;
        break;
        default:
        break;  
    }
}

/*!
    \brief      disable the Master_TIMER or Slave_TIMER update event
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_timers_update_event_disable(uint32_t hrtimer_periph, uint32_t timer_id)
{
    switch(timer_id)
    {
        case HRTIMER_MASTER_TIMER:
            /* disable the Master_TIMER update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_MTUPDIS;
        break;
        case HRTIMER_SLAVE_TIMER0:
            /* disable the Slave_TIMER0 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST0UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER1:
            /* disable the Slave_TIMER1 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST1UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER2:
            /* disable the Slave_TIMER2 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST2UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER3:
            /* disable the Slave_TIMER3 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST3UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER4:
            /* disable the Slave_TIMER4 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST4UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER5:
            /* disable the Slave_TIMER5 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST5UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER6:
            /* disable the Slave_TIMER6 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST6UPDIS;
        break;
        case HRTIMER_SLAVE_TIMER7:
            /* disable the Slave_TIMER7 update event */
            HRTIMER_CTL0(hrtimer_periph) |= HRTIMER_CTL0_ST7UPDIS;
        break;
        default:
        break;  
    }
}

/*!
    \brief      trigger the Master_TIMER and Slave_TIMER registers update by software
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timersrc: which timer to be update by software
                only one can be selected which is shown as below:
      \arg         HRTIMER_UPDATE_SW_MT: Master_TIMER software update
      \arg         HRTIMER_UPDATE_SW_ST0: Slave_TIMER0 software update
      \arg         HRTIMER_UPDATE_SW_ST1: Slave_TIMER1 software update
      \arg         HRTIMER_UPDATE_SW_ST2: Slave_TIMER2 software update
      \arg         HRTIMER_UPDATE_SW_ST3: Slave_TIMER3 software update
      \arg         HRTIMER_UPDATE_SW_ST4: Slave_TIMER4 software update
      \arg         HRTIMER_UPDATE_SW_ST5: Slave_TIMER5 software update
      \arg         HRTIMER_UPDATE_SW_ST6: Slave_TIMER6 software update
      \arg         HRTIMER_UPDATE_SW_ST7: Slave_TIMER7 software update
    \param[out] none
    \retval     none
*/
void hrtimer_software_update(uint32_t hrtimer_periph, uint32_t timersrc)
{
    HRTIMER_CTL1(hrtimer_periph) |= timersrc;
}

/*!
    \brief      reset the Master_TIMER and Slave_TIMER counter by software 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timerrst: which timer to be reset by software
                only one can be selected which is shown as below:
      \arg         HRTIMER_COUNTER_RESET_SW_MT: Master_TIMER software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST0: Slave_TIMER0 software reset  
      \arg         HRTIMER_COUNTER_RESET_SW_ST1: Slave_TIMER1 software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST2: Slave_TIMER2 software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST3: Slave_TIMER3 software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST4: Slave_TIMER4 software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST5: Slave_TIMER5 software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST6: Slave_TIMER6 software reset
      \arg         HRTIMER_COUNTER_RESET_SW_ST7: Slave_TIMER7 software reset
    \param[out] none
    \retval     none
*/
void hrtimer_software_counter_reset(uint32_t hrtimer_periph, uint32_t timerrst)
{
    HRTIMER_CTL1(hrtimer_periph) |= timerrst;
}

/*!
    \brief      exchange Slave_TIMERx outputs 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timerexc: which timer to be exchange output
                only one can be selected which is shown as below:
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST0: Slave_TIMER0 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST1: Slave_TIMER1 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST2: Slave_TIMER2 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST3: Slave_TIMER3 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST4: Slave_TIMER4 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST5: Slave_TIMER5 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST6: Slave_TIMER6 exchange output
      \arg         HRTIMER_OUTPUT_EXCHANGE_ST7: Slave_TIMER7 exchange output
    \param[out] none
    \retval     none
*/
void hrtimer_output_exchange(uint32_t hrtimer_periph, uint32_t timerexc)
{
    HRTIMER_CTL1(hrtimer_periph) |= timerexc;
}
/*!
    \brief      initialize waveform mode initialization parameters struct with a default value
    \param[in]  timerinit: HRTIMER waveform mode initialization parameters
    \param[out] none
    \retval     none
*/
void hrtimer_timerinit_struct_para_init(hrtimer_timerinit_parameter_struct* timerinit)
{
    timerinit->cnt_bunch = HRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK;
    timerinit->dac_trigger = HRTIMER_DAC_TRIGGER_NONE;
    timerinit->half_mode = HRTIMER_HALFMODE_DISABLED;
    timerinit->resynchronized_update = HRTIMER_RSYUPD_DISABLED;
    timerinit->alternate_mode = HRTIMER_ALTERNATE_MODE_DISABLED;   
    timerinit->repetition_update = HRTIMER_UPDATEONREPETITION_DISABLED;
    timerinit->reset_sync = HRTIMER_SYNCRESET_DISABLED;
    timerinit->shadow = HRTIMER_SHADOW_DISABLED;
    timerinit->start_sync = HRTIMER_SYNISTART_DISABLED;
    timerinit->update_selection = HRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT;
}

/*!
    \brief      initialize a timer to work in waveform mode 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  timerinitpara: HRTIMER waveform mode initialization parameters
                  half_mode: HRTIMER_HALFMODE_DISABLED, HRTIMER_HALFMODE_ENABLED
                  alternate_mode: HRTIMER_ALTERNATE_MODE_DISABLED,HRTIMER_ALTERNATE_MODE_TRIPLE,HRTIMER_ALTERNATE_MODE_QUAD
                  start_sync: HRTIMER_SYNISTART_DISABLED, HRTIMER_SYNISTART_ENABLED
                  reset_sync: HRTIMER_SYNCRESET_DISABLED, HRTIMER_SYNCRESET_ENABLED
                  dac_trigger: HRTIMER_DAC_TRIGGER_NONE, HRTIMER_DAC_TRIGGER_DACTRIGy(y=0..2)
                  shadow: HRTIMER_SHADOW_DISABLED, HRTIMER_SHADOW_ENABLED
                  update_selection: HRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT, for Master_TIMER and Slave_TIMER
                                    HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE, for Master_TIMER and Slave_TIMER
                                    HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE_UPDATE, for Master_TIMER and Slave_TIMER
                                    HRTIMER_ST_UPDATE_SELECTION_STXUPINy(y=0..2), for Slave_TIMER
                                    HRTIMER_ST_UPDATE_SELECTION_STXUPINy_UPDATE(y=0..2), for Slave_TIMER
                  cnt_bunch: HRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK, HRTIMER_TIMERBUNCHMODE_RESETCOUNTER
                  repetition_update: HRTIMER_UPDATEONREPETITION_DISABLED, HRTIMER_UPDATEONREPETITION_ENABLED
                  resynchronized_update:HRTIMER_RSYUPD_DISABLED,HRTIMER_RSYUPD_ENABLED
    \param[out] none
    \retval     none
*/
void hrtimer_timers_waveform_init(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_timerinit_parameter_struct* timerinitpara)
{
    if(HRTIMER_MASTER_TIMER == timer_id)
    {
        /* configure Master_TIMER in waveform mode */
        master_timer_waveform_config(hrtimer_periph, timerinitpara);
    }else{
        /* configure Slave_TIMER in waveform mode */
        slave_timer_waveform_config(hrtimer_periph, timer_id, timerinitpara);
    }
}

/*!
    \brief      initialize Slave_TIMER general behavior configuration struct with a default value
    \param[in]  timercfg: Slave_TIMER general behavior configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_timercfg_struct_para_init(hrtimer_timercfg_parameter_struct* timercfg)
{
    timercfg->balanced_mode = HRTIMER_STXBALANCEDMODE_DISABLED;
    timercfg->balanced_idle_automatic_resume = HRTIMER_BALANE_IDLE_AUTOMATIC_RESUME_DISABLE;
    timercfg->cnt_reset = HRTIMER_STXCNT_RESET_NONE;
    timercfg->deadtime_enable = HRTIMER_STXDEADTIME_DISABLED;
    timercfg->delayed_idle = HRTIMER_STXDELAYED_IDLE_DISABLED;
    timercfg->fault_enable = HRTIMER_STXFAULTENABLE_NONE;
    timercfg->fault_protect = HRTIMER_STXFAULT_PROTECT_READWRITE;
    timercfg->fault_automatic_resume = HRTIMER_STXFAULT_AUTOMATIC_RESUME_DISABLED;
    timercfg->reset_update = HRTIMER_STXUPDATEONRESET_DISABLED;
    timercfg->update_source = HRTIMER_STXUPDATETRIGGER_NONE;
}

/*!
    \brief      configure the general behavior of a Slave_TIMER which work in waveform mode 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  timercfg: Slave_TIMER general behavior configuration struct
                  balanced_mode: HRTIMER_STXBALANCEDMODE_DISABLED, HRTIMER_STXBALANCEDMODE_ENABLED
                  balanced_idle_automatic_resume: HRTIMER_BALANE_IDLE_AUTOMATIC_RESUME_DISABLE,HRTIMER_BALANE_IDLE_AUTOMATIC_RESUME_ENABLE
                  fault_enable: HRTIMER_STXFAULTENABLE_NONE, HRTIMER_STXFAULTENABLE_FAULT0, HRTIMER_STXFAULTENABLE_FAULT1, HRTIMER_STXFAULTENABLE_FAULT2, HRTIMER_STXFAULTENABLE_FAULT3 ,HRTIMER_STXFAULTENABLE_FAULT4,
                                HRTIMER_STXFAULTENABLE_FAULT5, HRTIMER_STXFAULTENABLE_FAULT6, HRTIMER_STXFAULTENABLE_FAULT7
                  fault_protect: HRTIMER_STXFAULT_PROTECT_READWRITE, HRTIMER_STXFAULT_PROTECT_READONLY
                  fault_automatic_resume: HRTIMER_STXFAULT_AUTOMATIC_RESUME_DISABLED,HRTIMER_STXFAULT_AUTOMATIC_RESUME_ENABLED
                  deadtime_enable: HRTIMER_STXDEADTIME_DISABLED, HRTIMER_STXDEADTIME_ENABLED
                  delayed_idle: HRTIMER_STXDELAYED_IDLE_DISABLED,HRTIMER_STXDELAYED_IDLE_CH0_EEV57,HRTIMER_STXDELAYED_IDLE_CH1_EEV57,HRTIMER_STXDELAYED_IDLE_BOTH_EEV57,HRTIMER_STXDELAYED_IDLE_BALANCED_EEV57,
                                 HRTIMER_STXDELAYED_IDLE_CH0_DEEV68,HRTIMER_STXDELAYED_IDLE_CH1_DEEV68,HRTIMER_STXDELAYED_IDLE_BOTH_EEV68,HRTIMER_STXDELAYED_IDLE_BALANCED_EEV68
                  update_source: HRTIMER_STXUPDATETRIGGER_NONE, HRTIMER_STXUPDATETRIGGER_MASTER, HRTIMER_STXUPDATETRIGGER_STx(x=0..7)
                  cnt_reset: HRTIMER_STXCNT_RESET_NONE, HRTIMER_STXCNT_RESET_UPDATE, HRTIMER_STXCNT_RESET_CMP1, HRTIMER_STXCNT_RESET_CMP3, HRTIMER_STXCNT_RESET_MASTER_PER, HRTIMER_STXCNT_RESET_MASTER_CMPy(y=0..3),
                             HRTIMER_STXCNT_RESET_EEV_y(y=0..9), HRTIMER_STXCNT_RESET_OTHERx_CMPy(x=0..3, y=0,1,3)
                  reset_update: HRTIMER_STXUPDATEONRESET_DISABLED, HRTIMER_STXUPDATEONRESET_ENABLED
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_waveform_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_timercfg_parameter_struct * timercfg)
{
    uint32_t stxctl0_reg;
    uint32_t stxfltctl_reg;
    uint32_t stxchoctl_reg;
    uint32_t stxcntrsta_reg;
    uint32_t stxactl_reg;

