wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    /* get the value of registers */
    stxctl0_reg = HRTIMER_STXCTL0(hrtimer_periph, timer_id);
    stxfltctl_reg = HRTIMER_STXFLTCTL(hrtimer_periph, timer_id);
    stxchoctl_reg = HRTIMER_STXCHOCTL(hrtimer_periph, timer_id);
    stxactl_reg = HRTIMER_STXACTL(hrtimer_periph, timer_id);
    
    stxcntrsta_reg = HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id);

    /* set the balanced mode */
    stxctl0_reg &= ~(HRTIMER_STXCTL0_BLNMEN);
    stxctl0_reg |= timercfg->balanced_mode;
  
    /* update event generated by reset event */
    stxctl0_reg &= ~(HRTIMER_STXCTL0_UPRST);
    stxctl0_reg |= timercfg->reset_update;
  
    /* set the timer update source in HRTIMER_STXCTL0 register */
    stxctl0_reg &= ~(STX_UPDATESOURCE_MASK0_5);    
    stxctl0_reg |= (uint32_t)(timercfg->update_source);
    /* set the timer update source in HRTIMER_STXACTL register */
    stxactl_reg &= ~(STX_UPDATESOURCE_MASK6_7);
    stxactl_reg |= (uint32_t)(timercfg->update_source >> 32);
    
    /* enable/disable fault automatic resume (at HRTIMER_STXACTL register) */
    stxactl_reg &= ~(HRTIMER_STXACTL_FLTAR);
    stxactl_reg |= (uint32_t)(timercfg->fault_automatic_resume);
    
    /* enable/disable the fault channel (at Slave_TIMER level) */
    stxfltctl_reg &= ~(STX_FAULTCH_MASK);
    stxfltctl_reg |= (timercfg->fault_enable & STX_FAULTCH_MASK);
  
    /* protect fault enable (at Slave_TIMER level) */
    stxfltctl_reg &= ~(HRTIMER_STXFLTCTL_FLTENPROT);
    stxfltctl_reg |= timercfg->fault_protect;
  
    /* enable/disable dead time insertion (at Slave_TIMER level) */
    stxchoctl_reg &= ~(HRTIMER_STXCHOCTL_DTEN);
    stxchoctl_reg |= timercfg->deadtime_enable;

    /* enable/disable delayed IDLE (at Slave_TIMER level) */
    stxchoctl_reg &= ~(HRTIMER_STXCHOCTL_DLYISCH| HRTIMER_STXCHOCTL_DLYISMEN);
    stxchoctl_reg |= timercfg->delayed_idle;
    
    /* balanced idle automatic resumption (at Slave_TIMER level) */
    stxchoctl_reg &= ~(HRTIMER_STXCHOCTL_BALIAR);
    stxchoctl_reg |= timercfg->balanced_idle_automatic_resume;
  
    /* configure the Slave_TIMER counter reset event in HRTIMER_STXCNTRST register */
    HRTIMER_STXCNTRST(hrtimer_periph, timer_id) = (uint32_t)(timercfg->cnt_reset);
    /* configure the Slave_TIMER counter reset event in HRTIMER_STXCNTRSTA register */
    stxcntrsta_reg &= ~0x0000007FU;
    stxcntrsta_reg |= (uint32_t)((timercfg->cnt_reset) >> 32U);
    HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id) = stxcntrsta_reg;

    HRTIMER_STXCTL0(hrtimer_periph, timer_id) = stxctl0_reg;
    HRTIMER_STXFLTCTL(hrtimer_periph, timer_id) = stxfltctl_reg;
    HRTIMER_STXCHOCTL(hrtimer_periph, timer_id) = stxchoctl_reg;
    HRTIMER_STXACTL(hrtimer_periph, timer_id) = stxactl_reg;
}


/*!
    \brief      initialize compare unit configuration struct with a default value
    \param[in]  comparecfg: compare unit configuration struct definitions
    \param[out] none
    \retval     none
*/
void hrtimer_comparecfg_struct_para_init(hrtimer_comparecfg_parameter_struct* comparecfg)
{
    comparecfg->compare_value = 0x0000U;
    comparecfg->delayed_mode = HRTIMER_DELAYEDMODE_DISABLE;
    comparecfg->timeout_value = 0x0U;
    comparecfg->trigger_half = HRTIMER_TRGHALFM_DISABLE;
    comparecfg->immediately_update_cmp0 = HRTIMER_IMMEDIATELY_UPDATE_CMP0_DISABLE;
    comparecfg->immediately_update_cmp2 = HRTIMER_IMMEDIATELY_UPDATE_CMP2_DISABLE;
}

/*!
    \brief      configure the compare unit of a Slave_TIMER which work in waveform mode 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  comparex: HRTIMER_COMPAREy(y=0..3)
    \param[in]  cmpcfg: compare unit configuration struct definitions
                  compare_value: min value: 3*tHRTIMER_CK clock, max value: 0xFFFF �C (1*tHRTIMER_CK)
                  delayed_mode: HRTIMER_DELAYEDMODE_DISABLE, HRTIMER_DELAYEDMODE_NOTIMEOUT, HRTIMER_DELAYEDMODE_TIMEOUTCMP0, HRTIMER_DELAYEDMODE_TIMEOUTCMP2
                  timeout_value: 0x0000~((timeout_value + compare_value) < 0xFFFF)
                  trigger_half: HRTIMER_TRGHALFM_DISABLE,HRTIMER_TRGHALFM_ENABLE
                  immediately_update_cmp0: HRTIMER_IMMEDIATELY_UPDATE_CMP0_DISABLE,HRTIMER_IMMEDIATELY_UPDATE_CMP0_ENABLE
                  immediately_update_cmp2: HRTIMER_IMMEDIATELY_UPDATE_CMP2_DISABLE,HRTIMER_IMMEDIATELY_UPDATE_CMP2_ENABLE
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_waveform_compare_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t comparex, hrtimer_comparecfg_parameter_struct* cmpcfg)
{
    uint32_t stxctl0_reg;
    uint32_t stxctl1_reg;
    
    /* configure the compare unit */
    switch (comparex)
    {
        case HRTIMER_COMPARE0:
        {
            /* set the compare value */
            HRTIMER_STXCMP0V(hrtimer_periph, timer_id) = cmpcfg->compare_value;
            /* configure immediately update of compare 0 */
            stxctl1_reg = HRTIMER_STXCTL1(hrtimer_periph, timer_id);
            stxctl1_reg &= ~HRTIMER_STXCTL1_IMUPD0V;
            stxctl1_reg |= cmpcfg->immediately_update_cmp0;
            HRTIMER_STXCTL1(hrtimer_periph, timer_id) = stxctl1_reg;
        }
        break;

        case HRTIMER_COMPARE1:
        {
            /* set the compare value */
            HRTIMER_STXCMP1V(hrtimer_periph, timer_id) = cmpcfg->compare_value;
            /* configure trigger half */
            stxctl1_reg = HRTIMER_STXCTL1(hrtimer_periph, timer_id);
            stxctl1_reg &= ~HRTIMER_STXCTL1_TRGHALFM;
            stxctl1_reg |= cmpcfg->trigger_half;
            HRTIMER_STXCTL1(hrtimer_periph, timer_id) = stxctl1_reg;

            if(HRTIMER_DELAYEDMODE_DISABLE != cmpcfg->delayed_mode){
                /* configure delayed mode */
                stxctl0_reg = HRTIMER_STXCTL0(hrtimer_periph, timer_id);
                stxctl0_reg &= ~HRTIMER_STXCTL0_DELCMP1M;
                stxctl0_reg |= cmpcfg->delayed_mode;
                HRTIMER_STXCTL0(hrtimer_periph, timer_id) = stxctl0_reg;
                /* set the compare value for timeout compare unit */
                if(HRTIMER_DELAYEDMODE_TIMEOUTCMP0 == cmpcfg->delayed_mode){
                    HRTIMER_STXCMP0V(hrtimer_periph, timer_id) = cmpcfg->timeout_value;
                }else if(HRTIMER_DELAYEDMODE_TIMEOUTCMP2 == cmpcfg->delayed_mode){
                    HRTIMER_STXCMP2V(hrtimer_periph, timer_id) = cmpcfg->timeout_value;
                }else{
                }
            }
        }
        break;

        case HRTIMER_COMPARE2:
        {
            /* set the compare value */
            HRTIMER_STXCMP2V(hrtimer_periph, timer_id) = cmpcfg->compare_value;
            /* configure immediately update of compare 2 */
            stxctl1_reg = HRTIMER_STXCTL1(hrtimer_periph, timer_id);
            stxctl1_reg &= ~HRTIMER_STXCTL1_IMUPD2V;
            stxctl1_reg |= cmpcfg->immediately_update_cmp2;
            HRTIMER_STXCTL1(hrtimer_periph, timer_id) = stxctl1_reg;
        }
        break;
        case HRTIMER_COMPARE3:
        {
            /* set the compare value */
            HRTIMER_STXCMP3V(hrtimer_periph, timer_id) = cmpcfg->compare_value;
          
            if(HRTIMER_DELAYEDMODE_DISABLE != cmpcfg->delayed_mode){
                /* configure delayed mode */
                stxctl0_reg = HRTIMER_STXCTL0(hrtimer_periph, timer_id);
                stxctl0_reg &= ~HRTIMER_STXCTL0_DELCMP3M;
                stxctl0_reg |= (cmpcfg->delayed_mode << 2);
                HRTIMER_STXCTL0(hrtimer_periph, timer_id) = stxctl0_reg;
                
                /* set the compare value for timeout compare unit */
                if(HRTIMER_DELAYEDMODE_TIMEOUTCMP0 == cmpcfg->delayed_mode){
                  HRTIMER_STXCMP0V(hrtimer_periph, timer_id) = cmpcfg->timeout_value;
                }else if(HRTIMER_DELAYEDMODE_TIMEOUTCMP2 == cmpcfg->delayed_mode){
                  HRTIMER_STXCMP2V(hrtimer_periph, timer_id) = cmpcfg->timeout_value;
                }else{
                }
            }
        }
        break;

        default:
        break;  
    }
}

/*!
    \brief      initialize channel output configuration struct with a default value 
    \param[in]  channelcfg: channel output configuration struct definitions
    \param[out] none
    \retval     none
*/
void hrtimer_channel_outputcfg_struct_para_init(hrtimer_channel_outputcfg_parameter_struct * channelcfg)
{
    channelcfg->carrier_mode = HRTIMER_CHANNEL_CARRIER_DISABLED;
    channelcfg->deadtime_bunch = HRTIMER_CHANNEL_BUNCH_ENTRY_REGULAR;
    channelcfg->fault_state = HRTIMER_CHANNEL_FAULTSTATE_NONE;
    channelcfg->idle_bunch = HRTIMER_CHANNEL_BUNCH_IDLE_DISABLE;
    channelcfg->idle_state = HRTIMER_CHANNEL_IDLESTATE_INACTIVE;
    channelcfg->polarity = HRTIMER_CHANNEL_POLARITY_HIGH;
    channelcfg->reset_request = HRTIMER_CHANNEL_RESET_NONE;
    channelcfg->set_request = HRTIMER_CHANNEL_SET_NONE;
}

/*!
    \brief      configure the channel output of a Slave_TIMER work in waveform mode 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  channel: HRTIMER_STx_CHy(x=0..7,y=0,1)
    \param[in]  channelcfg: channel output configuration struct definitions
                  polarity: HRTIMER_CHANNEL_POLARITY_HIGH, HRTIMER_CHANNEL_POLARITY_LOW
                  set_request: HRTIMER_CHANNEL_SET_NONE, HRTIMER_CHANNEL_SET_RSTSYNI, HRTIMER_CHANNEL_SET_PER, HRTIMER_CHANNEL_SET_CMPy(y=0..3),
                               HRTIMER_CHANNEL_SET_MTPER, HRTIMER_CHANNEL_SET_MTCMPy(y=0..3), HRTIMER_CHANNEL_SET_STEVy(y=0..8), HRTIMER_CHANNELx_SET_STEVy(x=0,1,y=9,10),
                               HRTIMER_CHANNEL_SET_EXEVy(y=0..9), HRTIMER_CHANNEL_SET_UPDATE, HRTIMER_CHANNELx_SET_STCNTRST(x=0,1)
                  reset_request: HRTIMER_CHANNEL_RESET_NONE, HRTIMER_CHANNEL_RESET_RSTSYNI, HRTIMER_CHANNEL_RESET_PER, HRTIMER_CHANNEL_RESET_CMPy(y=0..3),
                               HRTIMER_CHANNEL_RESET_MTPER, HRTIMER_CHANNEL_RESET_MTCMPy(y=0..3), HRTIMER_CHANNEL_RESET_STEVy(y=0..8), HRTIMER_CHANNELx_RESET_STEVy(x=0,1,y=9,10),
                               HRTIMER_CHANNEL_RESET_EXEVy(y=0..9), HRTIMER_CHANNEL_RESET_UPDATE, HRTIMER_CHANNELx_RESET_STCNTRST(x=0,1)
                  idle_bunch: HRTIMER_CHANNEL_BUNCH_IDLE_DISABLE, HRTIMER_CHANNEL_BUNCH_IDLE_ENABLE
                  idle_state: HRTIMER_CHANNEL_IDLESTATE_INACTIVE, HRTIMER_CHANNEL_IDLESTATE_ACTIVE
                  fault_state: HRTIMER_CHANNEL_FAULTSTATE_NONE, HRTIMER_CHANNEL_FAULTSTATE_ACTIVE, HRTIMER_CHANNEL_FAULTSTATE_INACTIVE, HRTIMER_CHANNEL_FAULTSTATE_HIGHZ
                  carrier_mode: HRTIMER_CHANNEL_CARRIER_DISABLED, HRTIMER_CHANNEL_CARRIER_ENABLED
                  deadtime_bunch: HRTIMER_CHANNEL_BUNCH_ENTRY_REGULAR, HRTIMER_CHANNEL_BUNCH_ENTRY_DEADTIME
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_waveform_channel_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel, hrtimer_channel_outputcfg_parameter_struct * channelcfg)
{
    channel_output_config(hrtimer_periph, timer_id, channel, channelcfg);
}

/*!
    \brief      software generates channel "set request" or "reset request"
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  channel: HRTIMER_STx_CHy(x=0..7,y=0,1)
    \param[in]  request: "set request" or "reset request"
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_CHANNEL_SOFTWARE_SET: software event cannot generate request
      \arg         HRTIMER_CHANNEL_SOFTWARE_RESET: software event can generate request
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_waveform_channel_software_request(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel, uint32_t request)
{
    /* configure the output set/reset crossbar */
    switch (channel)
    {
        /* configure the channel 0 output set/reset crossbar */
        case HRTIMER_ST0_CH0:
        case HRTIMER_ST1_CH0:
        case HRTIMER_ST2_CH0:
        case HRTIMER_ST3_CH0:
        case HRTIMER_ST4_CH0:
        case HRTIMER_ST5_CH0:
        case HRTIMER_ST6_CH0:
        case HRTIMER_ST7_CH0:
        {
            if(HRTIMER_CHANNEL_SOFTWARE_SET == request){
                /* software generates channel "set request" */
                HRTIMER_STXCH0SET(hrtimer_periph, timer_id) |= HRTIMER_STXCH0SET_CH0SSEV;
            }else{
                /* software generates channel "reset request" */
                HRTIMER_STXCH0RST(hrtimer_periph, timer_id) |= HRTIMER_STXCH0RST_CH0RSSEV;
            }
        }
        break;
        /* configure the channel 1 output set/reset crossbar */
        case HRTIMER_ST0_CH1:
        case HRTIMER_ST1_CH1:
        case HRTIMER_ST2_CH1:
        case HRTIMER_ST3_CH1:
        case HRTIMER_ST4_CH1:
        case HRTIMER_ST5_CH1:
        case HRTIMER_ST6_CH1:
        case HRTIMER_ST7_CH1:
        {
            if(HRTIMER_CHANNEL_SOFTWARE_SET == request){
                /* software generates channel "set request" */
                HRTIMER_STXCH1SET(hrtimer_periph, timer_id) |= HRTIMER_STXCH1SET_CH1SSEV;
            }else{
                /* software generates channel "reset request" */
                HRTIMER_STXCH1RST(hrtimer_periph, timer_id) |= HRTIMER_STXCH1RST_CH1RSSEV;
            }
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      get Slave_TIMER channel output level
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  channel: HRTIMER_STx_CHy(x=0..7,y=0,1)
    \param[out] none
    \retval     channel output level
*/
uint32_t hrtimer_slavetimer_waveform_channel_output_level_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel)
{
    uint32_t output_level = HRTIMER_CHANNEL_OUTPUT_INACTIVE;
    
