wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    switch (channel)
    {
        /* get Slave_TIMER channel 0 output level */
        case HRTIMER_ST0_CH0:
        case HRTIMER_ST1_CH0:
        case HRTIMER_ST2_CH0:
        case HRTIMER_ST3_CH0:
        case HRTIMER_ST4_CH0:
        case HRTIMER_ST5_CH0:
        case HRTIMER_ST6_CH0:
        case HRTIMER_ST7_CH0:
        {
            if(RESET != (HRTIMER_STXINTF(hrtimer_periph, timer_id) & HRTIMER_STXINTF_CH0F)){
                output_level = HRTIMER_CHANNEL_OUTPUT_ACTIVE;
            }else{
                output_level = HRTIMER_CHANNEL_OUTPUT_INACTIVE;
            }
        }
        break;
        /* get Slave_TIMER channel 1 output level */
        case HRTIMER_ST0_CH1:
        case HRTIMER_ST1_CH1:
        case HRTIMER_ST2_CH1:
        case HRTIMER_ST3_CH1:
        case HRTIMER_ST4_CH1:
        case HRTIMER_ST5_CH1:
        case HRTIMER_ST6_CH1:
        case HRTIMER_ST7_CH1:
        {
            if(RESET != (HRTIMER_STXINTF(hrtimer_periph, timer_id) & HRTIMER_STXINTF_CH1F)){
                output_level = HRTIMER_CHANNEL_OUTPUT_ACTIVE;
            }else{
                output_level = HRTIMER_CHANNEL_OUTPUT_INACTIVE;
            }
        }
        break;
        default:
        break;
    }
    return output_level;
}

/*!
    \brief      get Slave_TIMER channel run state
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  channel: HRTIMER_STx_CHy(x=0..7,y=0,1)
    \param[out] none
    \retval     channel state
*/
uint32_t hrtimer_slavetimer_waveform_channel_state_get(uint32_t hrtimer_periph, uint32_t channel)
{
    uint32_t enbit = 0U;
    uint32_t state = HRTIMER_CHANNEL_STATE_IDLE;
    
    switch (channel)
    {
        /* get Slave_TIMER0 channel 0 run state */
        case HRTIMER_ST0_CH0:
            enbit = HRTIMER_CHOUTEN_ST0CH0EN;
        break;
        /* get Slave_TIMER0 channel 1 run state */
        case HRTIMER_ST0_CH1:
            enbit = HRTIMER_CHOUTEN_ST0CH1EN;
        break;
        /* get Slave_TIMER1 channel 0 run state */
        case HRTIMER_ST1_CH0:
            enbit = HRTIMER_CHOUTEN_ST1CH0EN;
        break;
        /* get Slave_TIMER1 channel 1 run state */
        case HRTIMER_ST1_CH1:
            enbit = HRTIMER_CHOUTEN_ST1CH1EN;
        break;
        /* get Slave_TIMER2 channel 0 run state */
        case HRTIMER_ST2_CH0:
            enbit = HRTIMER_CHOUTEN_ST2CH0EN;
        break;
        /* get Slave_TIMER2 channel 1 run state */
        case HRTIMER_ST2_CH1:
            enbit = HRTIMER_CHOUTEN_ST2CH1EN;
        break;
        /* get Slave_TIMER3 channel 0 run state */
        case HRTIMER_ST3_CH0:
            enbit = HRTIMER_CHOUTEN_ST3CH0EN;
        break;
        /* get Slave_TIMER3 channel 1 run state */
        case HRTIMER_ST3_CH1:
            enbit = HRTIMER_CHOUTEN_ST3CH1EN;
        break;
        /* get Slave_TIMER4 channel 0 run state */
        case HRTIMER_ST4_CH0:
            enbit = HRTIMER_CHOUTEN_ST4CH0EN;
        break;
        /* get Slave_TIMER4 channel 1 run state */
        case HRTIMER_ST4_CH1:
            enbit = HRTIMER_CHOUTEN_ST4CH1EN;
        break;
        /* get Slave_TIMER5 channel 0 run state */
        case HRTIMER_ST5_CH0:
            enbit = HRTIMER_CHOUTEN_ST5CH0EN;
        break;
        /* get Slave_TIMER5 channel 1 run state */
        case HRTIMER_ST5_CH1:
            enbit = HRTIMER_CHOUTEN_ST5CH1EN;
        break;
        /* get Slave_TIMER6 channel 0 run state */
        case HRTIMER_ST6_CH0:
            enbit = HRTIMER_CHOUTEN_ST6CH0EN;
        break;
        /* get Slave_TIMER6 channel 1 run state */
        case HRTIMER_ST6_CH1:
            enbit = HRTIMER_CHOUTEN_ST6CH1EN;
        break;
        /* get Slave_TIMER7 channel 0 run state */
        case HRTIMER_ST7_CH0:
            enbit = HRTIMER_CHOUTEN_ST7CH0EN;
        break;
        /* get Slave_TIMER7 channel 1 run state */
        case HRTIMER_ST7_CH1:
            enbit = HRTIMER_CHOUTEN_ST7CH1EN;
        break;
        default:
        break;
    }
    if ( RESET != (HRTIMER_CHOUTEN(hrtimer_periph) & enbit)){
        /* Run state*/
        state = HRTIMER_CHANNEL_STATE_RUN;
    }else{
        if (RESET != (HRTIMER_CHOUTDISF(hrtimer_periph) & enbit)){
            /* Fault state */ 
            state = HRTIMER_CHANNEL_STATE_FAULT;
        }else{
            /* Idle state */
            state = HRTIMER_CHANNEL_STATE_IDLE;
        }
    }
    return state;
}

/*!
    \brief      initialize dead time configuration struct with a default value
    \param[in]  dtcfg: dead time configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_deadtimercfg_struct_para_init(hrtimer_deadtimecfg_parameter_struct * dtcfg)
{
    dtcfg->fallingsign_protect = HRTIMER_DEADTIME_FALLINGSIGN_PROTECT_DISABLE;
    dtcfg->falling_protect = HRTIMER_DEADTIME_FALLING_PROTECT_DISABLE;
    dtcfg->falling_sign = HRTIMER_DEADTIME_FALLINGSIGN_POSITIVE;
    dtcfg->falling_value = 0U;
    dtcfg->prescaler = HRTIMER_DEADTIME_PRESCALER_MUL8;
    dtcfg->risingsign_protect = HRTIMER_DEADTIME_RISINGSIGN_PROTECT_DISABLE;
    dtcfg->rising_protect = HRTIMER_DEADTIME_RISING_PROTECT_DISABLE;
    dtcfg->rising_sign = HRTIMER_DEADTIME_RISINGSIGN_POSITIVE;
    dtcfg->rising_value = 0U;
}

/*!
    \brief      configure the dead time for Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  dtcfg: dead time configuration struct
                  prescaler: HRTIMER_DEADTIME_PRESCALER_MULy(y=32,16,8,4,2), HRTIMER_DEADTIME_PRESCALER_DIVy(y=1,2,4,8,16)
                  rising_value: 0x0000~0xFFFF
                  rising_sign: HRTIMER_DEADTIME_RISINGSIGN_POSITIVE, HRTIMER_DEADTIME_RISINGSIGN_NEGATIVE
                  rising_protect: HRTIMER_DEADTIME_RISING_PROTECT_DISABLE, HRTIMER_DEADTIME_RISING_PROTECT_ENABLE
                  risingsign_protect: HRTIMER_DEADTIME_RISINGSIGN_PROTECT_DISABLE, HRTIMER_DEADTIME_RISINGSIGN_PROTECT_ENABLE
                  falling_value: 0x0000~0xFFFF
                  falling_sign: HRTIMER_DEADTIME_FALLINGSIGN_POSITIVE, HRTIMER_DEADTIME_FALLINGSIGN_NEGATIVE
                  falling_protect: HRTIMER_DEADTIME_FALLING_PROTECT_DISABLE, HRTIMER_DEADTIME_FALLING_PROTECT_ENABLE
                  fallingsign_protect: HRTIMER_DEADTIME_FALLINGSIGN_PROTECT_DISABLE, HRTIMER_DEADTIME_FALLINGSIGN_PROTECT_ENABLE
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_deadtime_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_deadtimecfg_parameter_struct* dtcfg)
{
    uint32_t dtctl_reg;
    uint32_t stxactl;

    dtctl_reg = HRTIMER_STXDTCTL(hrtimer_periph, timer_id);
    stxactl = HRTIMER_STXACTL(hrtimer_periph, timer_id);
     
    /* clear dead time configuration */
    dtctl_reg &= ~(HRTIMER_STXDTCTL_DTRCFG8_0 | HRTIMER_STXDTCTL_DTRS | HRTIMER_STXDTCTL_DTGCKDIV |
                 HRTIMER_STXDTCTL_DTRSPROT | HRTIMER_STXDTCTL_DTRSVPROT | HRTIMER_STXDTCTL_DTFCFG8_0 |
                 HRTIMER_STXDTCTL_DTFS | HRTIMER_STXDTCTL_DTFSPROT | HRTIMER_STXDTCTL_DTFSVPROT);
    stxactl &= ~(HRTIMER_STXACTL_DTRCFG15_9 | HRTIMER_STXACTL_DTFCFG15_9);
  
    /* set dead time configuration */
    dtctl_reg |= (dtcfg->prescaler << 10);
    dtctl_reg |= ((dtcfg->rising_value) & HRTIMER_STXDTCTL_DTRCFG8_0);
    stxactl |= (((dtcfg->rising_value) & (~HRTIMER_STXDTCTL_DTRCFG8_0)));
    dtctl_reg |= dtcfg->rising_sign;
    dtctl_reg |= dtcfg->risingsign_protect;
    dtctl_reg |= dtcfg->rising_protect;
    dtctl_reg |= (((dtcfg->falling_value) & HRTIMER_STXDTCTL_DTRCFG8_0) << 16);
    stxactl |= ((dtcfg->falling_value) & (~HRTIMER_STXDTCTL_DTRCFG8_0)) << 16;
    dtctl_reg |= dtcfg->falling_sign;
    dtctl_reg |= dtcfg->fallingsign_protect;
    dtctl_reg |= dtcfg->falling_protect;
    
    HRTIMER_STXACTL(hrtimer_periph, timer_id) = stxactl;
    HRTIMER_STXDTCTL(hrtimer_periph, timer_id) = dtctl_reg;
}

/*!
    \brief      initialize carrier signal configuration struct with a default value
    \param[in]  carriercfg: carrier signal configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_carriersignalcfg_struct_para_init(hrtimer_carriersignalcfg_parameter_struct* carriercfg)
{
    carriercfg->duty_cycle = 0U;
    carriercfg->first_pulse = 0U;
    carriercfg->period = 0U;
}

/*!
    \brief      configure the carrier signal mode for Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  carriercfg: carrier signal configuration struct
                  period: 0x0~0xF. specifies carrier signal period: (period + 1) * 16 * tHRTIMER_CK
                  duty_cycle: 0x0~0x7. specifies Carrier signal duty cycle: duty_cycle/8
                  first_pulse: 0x0~0xF. specifies first carrier-signal pulse width: (first_pulse+1) * 16 * tHRTIMER_CK
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_carriersignal_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_carriersignalcfg_parameter_struct* carriercfg)
{
    uint32_t csctl_reg;
  
    csctl_reg = HRTIMER_STXCSCTL(hrtimer_periph, timer_id);
     
    /* clear timer chopper mode configuration */
    csctl_reg &= ~(HRTIMER_STXCSCTL_CSPRD | HRTIMER_STXCSCTL_CSDTY | HRTIMER_STXCSCTL_CSFSTPW);
  
    /* set timer chopper mode configuration */
    csctl_reg |= carriercfg->period;
    csctl_reg |= (carriercfg->duty_cycle << 4);
    csctl_reg |= (carriercfg->first_pulse << 7);
    
    HRTIMER_STXCSCTL(hrtimer_periph, timer_id) = csctl_reg;
}

/*!
    \brief      enable a output channel
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  chid: specify the channel to configure
                only one can be selected which is shown as below:
      \arg          HRTIMER_ST0_CH0: ST0CH0_O output channel
      \arg          HRTIMER_ST0_CH1: ST0CH1_O output channel
      \arg          HRTIMER_ST1_CH0: ST1CH0_O output channel
      \arg          HRTIMER_ST1_CH1: ST1CH1_O output channel
      \arg          HRTIMER_ST2_CH0: ST2CH0_O output channel
      \arg          HRTIMER_ST2_CH1: ST2CH1_O output channel
      \arg          HRTIMER_ST3_CH0: ST3CH0_O output channel
      \arg          HRTIMER_ST3_CH1: ST3CH1_O output channel
      \arg          HRTIMER_ST4_CH0: ST4CH0_O output channel
      \arg          HRTIMER_ST4_CH1: ST4CH1_O output channel
      \arg          HRTIMER_ST5_CH0: ST5CH0_O output channel
      \arg          HRTIMER_ST5_CH1: ST5CH1_O output channel
      \arg          HRTIMER_ST6_CH0: ST6CH0_O output channel
      \arg          HRTIMER_ST6_CH1: ST6CH1_O output channel
      \arg          HRTIMER_ST7_CH0: ST7CH0_O output channel
      \arg          HRTIMER_ST7_CH1: ST7CH1_O output channel
    \param[out] none
    \retval     none
*/
void hrtimer_output_channel_enable(uint32_t hrtimer_periph, uint32_t chid)
{
    HRTIMER_CHOUTEN(hrtimer_periph) = chid;
}

/*!
    \brief      disable a output channel
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  chid: specify the channel to configure
                only one can be selected which is shown as below:
      \arg          HRTIMER_ST0_CH0: ST0CH0_O output channel
      \arg          HRTIMER_ST0_CH1: ST0CH1_O output channel
      \arg          HRTIMER_ST1_CH0: ST1CH0_O output channel
      \arg          HRTIMER_ST1_CH1: ST1CH1_O output channel
      \arg          HRTIMER_ST2_CH0: ST2CH0_O output channel
      \arg          HRTIMER_ST2_CH1: ST2CH1_O output channel
      \arg          HRTIMER_ST3_CH0: ST3CH0_O output channel
      \arg          HRTIMER_ST3_CH1: ST3CH1_O output channel
      \arg          HRTIMER_ST4_CH0: ST4CH0_O output channel
      \arg          HRTIMER_ST4_CH1: ST4CH1_O output channel
      \arg          HRTIMER_ST5_CH0: ST5CH0_O output channel
      \arg          HRTIMER_ST5_CH1: ST5CH1_O output channel
      \arg          HRTIMER_ST6_CH0: ST6CH0_O output channel
      \arg          HRTIMER_ST6_CH1: ST6CH1_O output channel
      \arg          HRTIMER_ST7_CH0: ST7CH0_O output channel
      \arg          HRTIMER_ST7_CH1: ST7CH1_O output channel
    \param[out] none
    \retval     none
*/
void hrtimer_output_channel_disable(uint32_t hrtimer_periph, uint32_t chid)
{
    HRTIMER_CHOUTDIS(hrtimer_periph) = chid;
}

/*!
    \brief      configure the compare value in Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  comparex: HRTIMER_COMPAREy(y=0..3), HRTIMER_COMPARE0_COMPOSITE
    \param[in]  cmpvalue:  min value: 3 tHRTIMER_CK clock, max value: 0xFFFF - (1 tHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_compare_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t comparex, uint32_t cmpvalue)
{
    /* configure the compare unit */
    switch (comparex)
    {
        case HRTIMER_COMPARE0:
        {
            /* set the compare 0 value */
            HRTIMER_STXCMP0V(hrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE1:
        {
            /* set the compare 1 value */
            HRTIMER_STXCMP1V(hrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE2:
        {
            /* set the compare 2 value */
            HRTIMER_STXCMP2V(hrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE3:
        {
            /* set the compare 3 value */
            HRTIMER_STXCMP3V(hrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE0_COMPOSITE:
        {
            /* set the compare 0 composite value */
            HRTIMER_STXCMP0CP(hrtimer_periph, timer_id) = cmpvalue;
        }
        break;
        default:
        break;
    }  
}

/*!
    \brief      get the compare value in Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  comparex: HRTIMER_COMPAREy(y=0..3), HRTIMER_COMPARE0_COMPOSITE
    \param[out] none
    \retval     the compare value
*/
uint32_t hrtimer_slavetimer_compare_value_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t comparex)
{
    uint32_t cmpval = 0U;
    /* configure the compare unit */
    switch (comparex)
    {
        case HRTIMER_COMPARE0:
        {
            /* get the compare 0 value */
            cmpval = HRTIMER_STXCMP0V(hrtimer_periph, timer_id);
        }
        break;
        case HRTIMER_COMPARE1:
        {
            /* get the compare 1 value */
            cmpval = HRTIMER_STXCMP1V(hrtimer_periph, timer_id);
        }
        break;
        case HRTIMER_COMPARE2:
        {
            /* get the compare 2 value */
            cmpval = HRTIMER_STXCMP2V(hrtimer_periph, timer_id);
        }
        break;
        case HRTIMER_COMPARE3:
        {
            /* get the compare 3 value */
            cmpval = HRTIMER_STXCMP3V(hrtimer_periph, timer_id);
        }
        break;
        case HRTIMER_COMPARE0_COMPOSITE:
        {
            /* get the compare 0 composite value */
            cmpval = HRTIMER_STXCMP0CP(hrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }  
    return cmpval;
}

/*!
    \brief      configure the compare value in Master_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  comparex: HRTIMER_COMPAREy(y=0..3)
    \param[in]  cmpvalue: min value: 3*tHRTIMER_CK clock, max value: 0xFFFF - (1*tHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void hrtimer_mastertimer_compare_value_config(uint32_t hrtimer_periph, uint32_t comparex, uint32_t cmpvalue)
{
    /* configure the compare unit */
    switch (comparex)
    {
        case HRTIMER_COMPARE0:
        {
            /* set the compare 0 value */
            HRTIMER_MTCMP0V(hrtimer_periph) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE1:
        {
            /* set the compare 1 value */
            HRTIMER_MTCMP1V(hrtimer_periph) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE2:
        {
            /* set the compare 2 value */
            HRTIMER_MTCMP2V(hrtimer_periph) = cmpvalue;
        }
        break;
        case HRTIMER_COMPARE3:
        {
            /* set the compare 3 value */
            HRTIMER_MTCMP3V(hrtimer_periph) = cmpvalue;
        }
        break;
        default:
        break;
    }  
}

/*!
    \brief      get the compare value in Master_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  comparex: HRTIMER_COMPAREy(y=0..3)
    \param[out] none
    \retval     the compare value
*/
uint32_t hrtimer_mastertimer_compare_value_get(uint32_t hrtimer_periph, uint32_t comparex)
{
    uint32_t cmpval = 0U;
    switch (comparex)
    {
        case HRTIMER_COMPARE0:
        {
            /* get the compare 0 value */
            cmpval = HRTIMER_MTCMP0V(hrtimer_periph);
        }
        break;
        case HRTIMER_COMPARE1:
        {
            /* get the compare 1 value */
            cmpval = HRTIMER_MTCMP1V(hrtimer_periph);
        }
        break;
        case HRTIMER_COMPARE2:
        {
            /* get the compare 2 value */
            cmpval = HRTIMER_MTCMP2V(hrtimer_periph);
        }
        break;
        case HRTIMER_COMPARE3:
        {
            /* get the compare 3 value */
            cmpval = HRTIMER_MTCMP3V(hrtimer_periph);
        }
        break;
        default:
        break;
    }  
    return cmpval;
}

/*!
    \brief      configure the counter value in Master_TIMER and Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  cntvalue: min value: 3*tHRTIMER_CK clock, max value: 0xFFFF - (1*tHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void hrtimer_timers_counter_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t cntvalue)
{
    /* configure the counter */
    switch (timer_id)
    {
        case HRTIMER_MASTER_TIMER:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_MTCEN)){
                /* set the Master_TIMER counter value */
                HRTIMER_MTCNT(hrtimer_periph) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER0:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST0CEN)){
                /* set the Slave_TIMER0 compare value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER1:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST1CEN)){
                /* set the Slave_TIMER1 compare value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER2:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST2CEN)){
                /* set the Slave_TIMER2 compare value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER3:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST3CEN)){
                /* set the Slave_TIMER3 compare value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER4:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST4CEN)){
                /* set the Slave_TIMER4 counter value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER5:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST5CEN)){
                /* set the Slave_TIMER5 counter value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER6:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST6CEN)){
                /* set the Slave_TIMER6 counter value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        case HRTIMER_SLAVE_TIMER7:
        {
            if(RESET == (HRTIMER_MTCTL0(hrtimer_periph) & HRTIMER_MTCTL0_ST7CEN)){
                /* set the Slave_TIMER7 counter value */
                HRTIMER_STXCNT(hrtimer_periph, timer_id) = cntvalue;
            }
        }
        break;
        default:
        break;
    }  
}

/*!
    \brief      get the counter value in Master_TIMER and Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     the counter value
*/
uint32_t hrtimer_timers_counter_value_get(uint32_t hrtimer_periph, uint32_t timer_id)
{
    uint32_t cunval = 0U;
    
    switch (timer_id)
    {
        case HRTIMER_MASTER_TIMER:
        {
            /* get the Master_TIMER counter value */
            cunval = HRTIMER_MTCNT(hrtimer_periph);
        }
        break;
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
        {
            /* get the Slave_TIMER counter value */
            cunval = HRTIMER_STXCNT(hrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
    return cunval;
}

/*!
    \brief      configure the counter auto reload value in Master_TIMER and Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  carlvalue: min value: 3*tHRTIMER_CK clock, max value: 0xFFFF - (1*tHRTIMER_CK)
    \param[out] none
    \retval     none
*/
void hrtimer_timers_autoreload_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t carlvalue)
{
    /* configure the counter auto reload value */
    switch (timer_id)
    {
        case HRTIMER_MASTER_TIMER:
        {
            /* set the Master_TIMER counter value */
            HRTIMER_MTCAR(hrtimer_periph) = carlvalue;
        }
        break;
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
        {
            /* set the Slave_TIMER compare value */
            HRTIMER_STXCAR(hrtimer_periph, timer_id) = carlvalue;
        }
        break;
        default:
        break;
    }
}
/*!
    \brief      get the counter auto reload value in Master_TIMER and Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     the counter auto reload value
*/
uint32_t hrtimer_timers_autoreload_value_get(uint32_t hrtimer_periph, uint32_t timer_id)
{
    uint32_t cralval = 0U;
    
    switch (timer_id)
    {
        case HRTIMER_MASTER_TIMER:
        {
            /* get the Master_TIMER counter auto reload value value */
            cralval = HRTIMER_MTCAR(hrtimer_periph);
        }
        break;
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
        {
            /* get the Slave_TIMER counter auto reload value value */
            cralval = HRTIMER_STXCAR(hrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
    return cralval;
}

