wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
/*!
    \brief      configure the counter repetition value in Master_TIMER and Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  replvalue: 0~255
    \param[out] none
    \retval     none
*/
void hrtimer_timers_repetition_value_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t replvalue)
{
    /* configure the counter repetition value */
    switch (timer_id)
    {
        case HRTIMER_MASTER_TIMER:
        {
            /* set the Master_TIMER repetition value */
            HRTIMER_MTCREP(hrtimer_periph) = replvalue;
        }
        break;
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
        {
            /* set the Slave_TIMER repetition value */
            HRTIMER_STXCREP(hrtimer_periph, timer_id) = replvalue;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      get the counter repetition value in Master_TIMER and Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     the counter repetition value
*/
uint32_t hrtimer_timers_repetition_value_get(uint32_t hrtimer_periph, uint32_t timer_id)
{
    uint32_t repval = 0U;
    
    switch (timer_id)
    {
        case HRTIMER_MASTER_TIMER:
        {
            /* get the Master_TIMER counter repetition value value */
            repval = HRTIMER_MTCREP(hrtimer_periph);
        }
        break;
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
        {
            /* get the Slave_TIMER counter repetition value value */
            repval = HRTIMER_STXCREP(hrtimer_periph, timer_id);
        }
        break;
        default:
        break;
    }
    return repval;
}

/*!
    \brief      initialize external event filtering for Slave_TIMER configuration struct with a default value
    \param[in]  exevfilter: external event filtering for Slave_TIMER struct definitions
    \param[out] none
    \retval     none
*/
void hrtimer_exevfilter_struct_para_init(hrtimer_exevfilter_parameter_struct * exevfilter)
{
    exevfilter->filter_mode = HRTIMER_EXEVFILTER_DISABLE;
    exevfilter->memorized = HRTIMER_EXEVMEMORIZED_DISABLE;
}

/*!
    \brief      configure the external event filtering for Slave_TIMER (blanking, windowing)
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  event_id: HRTIMER_EXEVENT_NONE, HRTIMER_EXEVENT_y(y=0..9)
    \param[in]  exevfilter: external event filtering for Slave_TIMER struct definitions
                  filter_mode: HRTIMER_EXEVFILTER_DISABLE, HRTIMER_EXEVFILTER_BLANKINGCMPy(y=0,2), HRTIMER_EXEVFILTER_BLANKINGSRCy(y=0..9),
                  HRTIMER_EXEVFILTER_WINDOWINGCMPy(y=1,2,3),HRTIMER_EXEVFILTER_WINDOWINGCMP1_WITH2, HRTIMER_EXEVFILTER_WINDOWINGSRC
                  memorized: HRTIMER_EXEVMEMORIZED_DISABLE, HRTIMER_EXEVMEMORIZED_ENABLE
                  NOTE:In up-counting mode and center-aligned mode, when filter_mode is configured as HRTIMER_EXEVFILTER_WINDOWINGCMP1_WITH2 or HRTIMER_EXEVFILTER_WINDOWINGCMP3,
                  the external event memorized enable function is invalid.
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_exevent_filtering_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t event_id, hrtimer_exevfilter_parameter_struct *exevfilter)
{
    uint32_t exevfcfg_reg;

    switch (event_id)
    {
        /* reset external event filtering */
        case HRTIMER_EXEVENT_NONE:
        {
            HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id) = 0U;
            HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id) = 0U;
        }
        break;
        /* configure external event 0 filtering */
        case HRTIMER_EXEVENT_0:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG0_EXEV0FM | HRTIMER_STXEXEVFCFG0_EXEV0MEEN);
            exevfcfg_reg |= (exevfilter->filter_mode | exevfilter->memorized);
            HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 1 filtering */
        case HRTIMER_EXEVENT_1:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG0_EXEV1FM | HRTIMER_STXEXEVFCFG0_EXEV1MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 6);
            HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 2 filtering */
        case HRTIMER_EXEVENT_2:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG0_EXEV2FM | HRTIMER_STXEXEVFCFG0_EXEV2MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 12);
            HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 3 filtering */
        case HRTIMER_EXEVENT_3:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG0_EXEV3FM | HRTIMER_STXEXEVFCFG0_EXEV3MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 18);
            HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 4 filtering */
        case HRTIMER_EXEVENT_4:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG0_EXEV4FM | HRTIMER_STXEXEVFCFG0_EXEV4MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 24);
            HRTIMER_STXEXEVFCFG0(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 5 filtering */
        case HRTIMER_EXEVENT_5:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG1_EXEV5FM | HRTIMER_STXEXEVFCFG1_EXEV5MEEN);
            exevfcfg_reg |= (exevfilter->filter_mode | exevfilter->memorized);
            HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 6 filtering */
        case HRTIMER_EXEVENT_6:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG1_EXEV6FM | HRTIMER_STXEXEVFCFG1_EXEV6MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 6);
            HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 7 filtering */
        case HRTIMER_EXEVENT_7:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG1_EXEV7FM | HRTIMER_STXEXEVFCFG1_EXEV7MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 12);
            HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 8 filtering */
        case HRTIMER_EXEVENT_8:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG1_EXEV8FM | HRTIMER_STXEXEVFCFG1_EXEV8MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 18);
            HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        /* configure external event 9 filtering */
        case HRTIMER_EXEVENT_9:
        {
            exevfcfg_reg = HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id);
            exevfcfg_reg &= ~(HRTIMER_STXEXEVFCFG1_EXEV9FM | HRTIMER_STXEXEVFCFG1_EXEV9MEEN);
            exevfcfg_reg |= ((exevfilter->filter_mode | exevfilter->memorized) << 24);
            HRTIMER_STXEXEVFCFG1(hrtimer_periph, timer_id) = exevfcfg_reg;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      initialize external event configuration struct with a default value
    \param[in]  exevcfg: external event configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_exeventcfg_struct_para_init(hrtimer_exeventcfg_parameter_struct * exevcfg)
{
    exevcfg->digital_filter = 0U;
    exevcfg->edge = HRTIMER_EXEV_EDGE_LEVEL;
    exevcfg->fast = HRTIMER_EXEV_FAST_DISABLE;
    exevcfg->polarity = HRTIMER_EXEV_POLARITY_HIGH;
    exevcfg->source = HRTIMER_EXEV_SRC0;
}

/*!
    \brief      configure the an external event
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  event_id: HRTIMER_EXEVENT_NONE, HRTIMER_EXEVENT_y(y=0..9)
    \param[in]  exevcfg: external event configuration struct
                  source: HRTIMER_EXEV_SRCy(y=0..3)
                  polarity: HRTIMER_EXEV_POLARITY_HIGH, HRTIMER_EXEV_POLARITY_LOW
                  edge: HRTIMER_EXEV_EDGE_LEVEL, HRTIMER_EXEV_EDGE_RISING, HRTIMER_EXEV_EDGE_FALLING, HRTIMER_EXEV_EDGE_BOTH
                  digital_filter: 0x0~0xF
                  fast：HRTIMER_EXEV_FAST_DISABLE,HRTIMER_EXEV_FAST_ENABLE
    \param[out] none
    \retval     none
*/
void hrtimer_exevent_config(uint32_t hrtimer_periph, uint32_t event_id, hrtimer_exeventcfg_parameter_struct* exevcfg)
{
    /* configure the an external event channel */
    external_event_config(hrtimer_periph, event_id, exevcfg);
}

/*!
    \brief      configure external event digital filter clock division
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  prescaler: clock division value
                only one parameter can be selected which is shown as below:
      \arg          HRTIMER_EXEV_PRESCALER_DIV1: fHRTIMER_EXEVFCK = fHRTIMER_CK 
      \arg          HRTIMER_EXEV_PRESCALER_DIV2: fHRTIMER_EXEVFCK = fHRTIMER_CK / 2 
      \arg          HRTIMER_EXEV_PRESCALER_DIV4: fHRTIMER_EXEVFCK = fHRTIMER_CK / 4 
      \arg          HRTIMER_EXEV_PRESCALER_DIV8: fHRTIMER_EXEVFCK = fHRTIMER_CK / 8 
    \param[out] none
    \retval     none
*/
void hrtimer_exevent_prescaler(uint32_t hrtimer_periph, uint32_t prescaler)
{
  uint32_t exevdfctl_reg;

  /* set the external event digital filter clock division */
  exevdfctl_reg = HRTIMER_EXEVDFCTL(hrtimer_periph);
  exevdfctl_reg &= ~(HRTIMER_EXEVDFCTL_EXEVFDIV);
  exevdfctl_reg |= prescaler;

  HRTIMER_EXEVDFCTL(hrtimer_periph) = exevdfctl_reg;
}


/*!
    \brief      initialize external event configuration struct with a default value
    \param[in]  exevcnt: external event counter configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_exeventx_counter_struct_para_init(hrtimer_exeventcnt_parameter_struct *exevcnt)
{
    exevcnt->reset_mode = HRTIMER_EXEVX_RESET_MODE0;
    exevcnt->event_source = HRTIMER_EXEVX_SOURCE_EXEV0;
    exevcnt->counter_threshold = 0U;
}

/*!
    \brief      configure the external event X counter
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  exevcnt: external event X filter counter configuration struct
                  reset_mode: HRTIMER_EXEVX_RESET_MODE0, HRTIMER_EXEVX_RESET_MODE1
                  event_source: HRTIMER_EXEVX_SOURCE_EXEVy,(y = 0..9)
                  counter_threshold: 0x00~0x3F
    \param[out] none
    \retval     none
*/
void hrtimer_exeventx_counter_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_exeventcnt_parameter_struct *exevcnt)
{
    uint32_t exevfcfg2;

