wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    /* configure the external event X counter */
    exevfcfg2 = HRTIMER_STXEXEVFCFG2(hrtimer_periph, timer_id);
    exevfcfg2 &= ~(HRTIMER_STXEXEVFCFG2_EXTEXRSTM|HRTIMER_STXEXEVFCFG2_EXTEXSEL|HRTIMER_STXEXEVFCFG2_EXTEXCNTTHR);
    exevfcfg2 |= ((exevcnt->counter_threshold << 8) | exevcnt->event_source | exevcnt->reset_mode);
    HRTIMER_STXEXEVFCFG2(hrtimer_periph, timer_id) = exevfcfg2;
}

/*!
    \brief      reset external event X counter
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_software_reset_exeventx_counter(uint32_t hrtimer_periph, uint32_t timer_id)
{
    HRTIMER_STXEXEVFCFG2(hrtimer_periph, timer_id) |= HRTIMER_STXEXEVFCFG2_EXTEXCRST;
}

/*!
    \brief      enable external event X counter
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_exeventx_counter_enable(uint32_t hrtimer_periph, uint32_t timer_id)
{
    HRTIMER_STXEXEVFCFG2(hrtimer_periph,timer_id) |= HRTIMER_STXEXEVFCFG2_EXTEXCEN;
}

/*!
    \brief      disable external event X counter
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_exeventx_counter_disable(uint32_t hrtimer_periph, uint32_t timer_id)
{
    HRTIMER_STXEXEVFCFG2(hrtimer_periph,timer_id) &= ~HRTIMER_STXEXEVFCFG2_EXTEXCEN;
}

/*!
    \brief      enable a output channel
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     none
*/
uint32_t hrtimer_exeventx_counter_read(uint32_t hrtimer_periph, uint32_t timer_id)
{
    uint32_t exevfcfg2;
    exevfcfg2 = HRTIMER_STXEXEVFCFG2(hrtimer_periph,timer_id);
    return ((exevfcfg2 & HRTIMER_STXEXEVFCFG2_EXTEXCNT)>> 26);
}

/*!
    \brief      initialize synchronization configuration struct with a default value
    \param[in]  synccfg: synchronization configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_synccfg_struct_para_init(hrtimer_synccfg_parameter_struct* synccfg)
{
    synccfg->input_source = HRTIMER_SYNCINPUTSOURCE_DISABLE;
    synccfg->output_polarity = HRTIMER_SYNCOUTPUTPOLARITY_DISABLE;
    synccfg->output_source = HRTIMER_SYNCOUTPUTSOURCE_MTSTART;
}

/*!
    \brief      configure the synchronization input/output of the HRTIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  synccfg: synchronization configuration struct
                  input_source: HRTIMER_SYNCINPUTSOURCE_DISABLE, HRTIMER_SYNCINPUTSOURCE_INTERNAL, HRTIMER_SYNCINPUTSOURCE_EXTERNAL
                  output_source: HRTIMER_SYNCOUTPUTSOURCE_MTSTART, HRTIMER_SYNCOUTPUTSOURCE_MTCMP0, HRTIMER_SYNCOUTPUTSOURCE_ST0START, HRTIMER_SYNCOUTPUTSOURCE_ST0CMP0
                  output_polarity: HRTIMER_SYNCOUTPUTPOLARITY_DISABLE, HRTIMER_SYNCOUTPUTPOLARITY_POSITIVE, HRTIMER_SYNCOUTPUTPOLARITY_NEGATIVE
    \param[out] none
    \retval     none
*/
void hrtimer_synchronization_config(uint32_t hrtimer_periph, hrtimer_synccfg_parameter_struct* synccfg)
{
    uint32_t mtctl0_reg;

    mtctl0_reg = HRTIMER_MTCTL0(hrtimer_periph);

    /* set the synchronization input source */
    mtctl0_reg &= ~(HRTIMER_MTCTL0_SYNISRC);
    mtctl0_reg |= synccfg->input_source;
  
    /* set the event to be sent on the synchronization output */
    mtctl0_reg &= ~(HRTIMER_MTCTL0_SYNOSRC);
    mtctl0_reg |= synccfg->output_source;
  
    /* set the polarity of the synchronization output */
    mtctl0_reg &= ~(HRTIMER_MTCTL0_SYNOPLS);
    mtctl0_reg |= synccfg->output_polarity;
  
    HRTIMER_MTCTL0(hrtimer_periph) = mtctl0_reg;
}

/*!
    \brief      initialize double channel trigger struct
    \param[in]  doubletrigger: dac trigger struct
    \param[out] none
    \retval     none
*/
void hrtimer_double_channel_struct_para_init(hrtimer_double_trigger_parameter_struct *doubletrigger)
{
    doubletrigger->trigger_enable = HRTIMER_DOUBLE_TRIG_DISABLE;
    doubletrigger->trigger0 = HRTIMER_DOUBLE_TRIG0_BY_CPV1;
    doubletrigger->trigger1 = HRTIMER_DOUBLE_TRIG1_BY_CNT_RESET;
}
/*!
    \brief      configure Slave_TIMER in double channel trigger
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  doubletrigger: double channel trigger struct
                  trigger_enable: HRTIMER_DOUBLE_TRIG_DISABLE,HRTIMER_DOUBLE_TRIG_ENABLE
                  trigger0: HRTIMER_DOUBLE_TRIG0_BY_CPV1,HRTIMER_DOUBLE_TRIG0_BY_CH0_RESET
                  trigger1: HRTIMER_DOUBLE_TRIG1_BY_CNT_RESET,HRTIMER_DOUBLE_TRIG1_BY_CH0_SET
    \param[out] none
    \retval     none
*/
void hrtimer_double_trigger_config(uint32_t hrtimer_periph, uint32_t timer_id, hrtimer_double_trigger_parameter_struct *doubletrigger)
{
    uint32_t stxctl1;
    stxctl1 = HRTIMER_STXCTL1(hrtimer_periph, timer_id);
    /* clear output config */
    stxctl1 &= ~(HRTIMER_STXCTL1_TRIGEN | HRTIMER_STXCTL1_TRIG0M | HRTIMER_STXCTL1_TRIG1M);
    /* config the trigger enable, step trigger, reset trigger */
    stxctl1 |= (doubletrigger->trigger_enable|doubletrigger->trigger0|doubletrigger->trigger1);
    HRTIMER_STXCTL1(hrtimer_periph, timer_id) = stxctl1;
}

/*!
    \brief      initialize roll over struct with a default value
    \param[in]  rollover: roll over struct
    \param[out] none
    \retval     none
*/
void hrtimer_roll_over_struct_para_init(hrtimer_roll_over_parameter_struct *rollover)
{
    rollover->roll_over_mode = HRTIMER_ROLLOVER_MODE0;
    rollover->output_roll_over_mode = HRTIMER_OUTPUT_ROLLOVER_MODE0;
    rollover->adc_roll_over_mode = HRTIMER_ADC_ROLLOVER_MODE0;
    rollover->bunch_mode_roll_over_mode = HRTIMER_BUNCH_MODE_ROLLOVER_MODE0;
    rollover->fault_event_roll_over_mode = HRTIMER_FAULT_EVENTROLLOVER_MODE0;
}

/*!
    \brief      configure Slave_TIMER in roll over mode
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  rollover: roll over struct definitions
                  roll_over_mode: HRTIMER_ROLLOVER_MODE0, HRTIMER_ROLLOVER_MODE1,HRTIMER_ROLLOVER_MODE2
                  output_roll_over_mode: HRTIMER_OUTPUT_ROLLOVER_MODE0, HRTIMER_OUTPUT_ROLLOVER_MODE1, HRTIMER_OUTPUT_ROLLOVER_MODE2
                  adc_roll_over_mode: HRTIMER_ADC_ROLLOVER_MODE0,HRTIMER_ADC_ROLLOVER_MODE1,HRTIMER_ADC_ROLLOVER_MODE2
                  bunch_mode_roll_over_mode: HRTIMER_BUNCH_MODE_ROLLOVER_MODE0,HRTIMER_BUNCH_MODE_ROLLOVER_MODE1,HRTIMER_BUNCH_MODE_ROLLOVER_MODE2
                  fault_event_roll_over_mode: HRTIMER_FAULT_EVENTROLLOVER_MODE0,HRTIMER_FAULT_EVENTROLLOVER_MODE1,HRTIMER_FAULT_EVENTROLLOVER_MODE1
    \param[out] none
    \retval     none
*/
void hrtimer_roll_over_mode_config(uint32_t hrtimer_periph, uint32_t timer_id,hrtimer_roll_over_parameter_struct *rollover)
{
    uint32_t stxctl1;
    stxctl1 = HRTIMER_STXCTL1(hrtimer_periph, timer_id);
    /* clear output config */
    stxctl1 &= ~(HRTIMER_STXCTL1_ROVM | HRTIMER_STXCTL1_OUTROVM | HRTIMER_STXCTL1_ADCROVM |HRTIMER_STXCTL1_BMROVM | HRTIMER_STXCTL1_FEROVM);
    /* config roll over mode */
    stxctl1 |= (rollover->roll_over_mode | rollover->output_roll_over_mode | rollover->adc_roll_over_mode | rollover->bunch_mode_roll_over_mode | rollover->fault_event_roll_over_mode);
    HRTIMER_STXCTL1(hrtimer_periph, timer_id) = stxctl1;
}

/*!
    \brief      initialize fault input configuration struct with a default value
    \param[in]  faultcfg: fault input configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_faultcfg_struct_para_init(hrtimer_faultcfg_parameter_struct * faultcfg)
{
    faultcfg->filter = 0x0U;
    faultcfg->polarity = HRTIMER_FAULT_POLARITY_LOW;
    faultcfg->protect = HRTIMER_FAULT_PROTECT_DISABLE;
    faultcfg->source = HRTIMER_FAULT_SOURCE_PIN;
    faultcfg->control = HRTIMER_FAULT_CHANNEL_DISABLE;
    faultcfg->blanksource = HRTIMER_FAULT_COMP_COMP;
    faultcfg->counter = 0U;
    faultcfg->resetmode = HRTIMER_FAULT_COUNTER_RESET_UNCONDITIONAL;
    faultcfg->blanksenable = HRTIMER_FAULT_BLKEN_DISABLE;
    faultcfg->fault_recovery_control = HRTIMER_FAULT_RECOVERY_CONTROL_DISABLE;
}

/*!
    \brief      configure the fault input
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  fault_id: HRTIMER_FAULT_y(y=0..7)
    \param[in]  faultcfg: fault input configuration struct
                  source: HRTIMER_FAULT_SOURCE_PIN, HRTIMER_FAULT_SOURCE_INTERNAL, HRTIMER_FAULT_SOURCE_EXT_EVENT
                  polarity: HRTIMER_FAULT_POLARITY_LOW, HRTIMER_FAULT_POLARITY_HIGH
                  control: HRTIMER_FAULT_CHANNEL_DISABLE, HRTIMER_FAULT_CHANNEL_ENABLE
                  filter: 0x0~0xF
                  protect: HRTIMER_FAULT_PROTECT_DISABLE, HRTIMER_FAULT_PROTECT_ENABLE
                  blanksource: HRTIMER_FAULT_COMP_COMP,HRTIMER_FAULT_RST_COMP
                  blankenable: HRTIMER_FAULT_BLKEN_DISABLE,HRTIMER_FAULT_BLKEN_ENABLE
                  counter: 0x0~0xF
                  resetmode: HRTIMER_FAULT_COUNTER_RESET_UNCONDITIONAL,HRTIMER_FAULT_COUNTER_RESET_CONDITIONAL
                  fault_recovery_control: HRTIMER_FAULT_RECOVERY_CONTROL_DISABLE, HRTIMER_FAULT_RECOVERY_CONTROL_ENABLE
    \param[out] none
    \retval     none
*/
void hrtimer_fault_config(uint32_t hrtimer_periph, uint32_t fault_id, hrtimer_faultcfg_parameter_struct* faultcfg)
{
    uint32_t fltincfg0;
    uint32_t fltincfg1;
    uint32_t fltincfg2;
    uint32_t fltincfg3;
    uint32_t fltincfg4;
  
    fltincfg0 = HRTIMER_FLTINCFG0(hrtimer_periph);
    fltincfg1 = HRTIMER_FLTINCFG1(hrtimer_periph);
    fltincfg2 = HRTIMER_FLTINCFG2(hrtimer_periph);
    fltincfg3 = HRTIMER_FLTINCFG3(hrtimer_periph);
    fltincfg4 = HRTIMER_FLTINCFG4(hrtimer_periph);
  
