wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    switch (fault_id)
    {
        case HRTIMER_FAULT_0:
        {
            /* configure fault input 0 */
            fltincfg0 &= ~( HRTIMER_FLTINCFG0_FLT0INP | HRTIMER_FLTINCFG0_FLT0INSRC0 | HRTIMER_FLTINCFG0_FLT0INFC | HRTIMER_FLTINCFG0_FLT0INPROT | HRTIMER_FLTINCFG0_FLT0INEN);
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT0INSRC1);
            fltincfg0 |= (((faultcfg->source & 0x00000001U) << 2) & HRTIMER_FLTINCFG0_FLT0INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 15) & HRTIMER_FLTINCFG1_FLT0INSRC1);
            fltincfg0 |= faultcfg->polarity;
            fltincfg0 |= ((faultcfg->filter) << 3);
            fltincfg0 |= faultcfg->control;
            fltincfg0 |= faultcfg->protect;
            
            fltincfg2 &= ~(HRTIMER_FLTINCFG2_FLT0BLKEN | HRTIMER_FLTINCFG2_FLT0BLKS | HRTIMER_FLTINCFG2_FLT0CNT | HRTIMER_FLTINCFG2_FLT0RST);
            fltincfg2 |= (faultcfg->blanksenable | faultcfg->blanksource | (faultcfg->counter <<2) | faultcfg->resetmode);
        }
        break;
        case HRTIMER_FAULT_1:
        {
            /* configure fault input 1 */
            fltincfg0 &= ~( HRTIMER_FLTINCFG0_FLT1INP | HRTIMER_FLTINCFG0_FLT1INSRC0 | HRTIMER_FLTINCFG0_FLT1INFC | HRTIMER_FLTINCFG0_FLT1INPROT | HRTIMER_FLTINCFG0_FLT1INEN );
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT1INSRC1);
            fltincfg0 |= (((faultcfg->source & 0x00000001U) << 10) & HRTIMER_FLTINCFG0_FLT1INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 16) & HRTIMER_FLTINCFG1_FLT1INSRC1);
            fltincfg0 |= ((faultcfg->polarity) << 8);
            fltincfg0 |= ((faultcfg->filter) << 11);
            fltincfg0 |= ((faultcfg->control) << 8);
            fltincfg0 |= ((faultcfg->protect) << 8);
            
            fltincfg2 &= ~(HRTIMER_FLTINCFG2_FLT1BLKEN | HRTIMER_FLTINCFG2_FLT1BLKS | HRTIMER_FLTINCFG2_FLT1CNT | HRTIMER_FLTINCFG2_FLT1RST);
            fltincfg2 |= ((faultcfg->blanksenable << 8) | (faultcfg->blanksource << 8) | (faultcfg->counter << 10) | (faultcfg->resetmode << 8));
        }
        break;
        case HRTIMER_FAULT_2:
        {
            /* configure fault input 2 */
            fltincfg0 &= ~( HRTIMER_FLTINCFG0_FLT2INP | HRTIMER_FLTINCFG0_FLT2INSRC0 | HRTIMER_FLTINCFG0_FLT2INFC | HRTIMER_FLTINCFG0_FLT2INPROT | HRTIMER_FLTINCFG0_FLT2INEN);
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT2INSRC1);
            fltincfg0 |= (((faultcfg->source & 0x00000001U) << 18) & HRTIMER_FLTINCFG0_FLT2INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 17) & HRTIMER_FLTINCFG1_FLT2INSRC1);
            fltincfg0 |= ((faultcfg->polarity) << 16);
            fltincfg0 |= ((faultcfg->filter) << 19);
            fltincfg0 |= ((faultcfg->control) << 16);
            fltincfg0 |= ((faultcfg->protect) << 16);
            
            fltincfg2 &= ~(HRTIMER_FLTINCFG2_FLT2BLKEN | HRTIMER_FLTINCFG2_FLT2BLKS | HRTIMER_FLTINCFG2_FLT2CNT | HRTIMER_FLTINCFG2_FLT2RST);
            fltincfg2 |= ((faultcfg->blanksenable << 16) | (faultcfg->blanksource << 16) | (faultcfg->counter << 18) | (faultcfg->resetmode << 16));
        }
        break;
        case HRTIMER_FAULT_3:
        {
            /* configure fault input 3 */
            fltincfg0 &= ~( HRTIMER_FLTINCFG0_FLT3INP | HRTIMER_FLTINCFG0_FLT3INSRC0 | HRTIMER_FLTINCFG0_FLT3INFC | HRTIMER_FLTINCFG0_FLT3INPROT | HRTIMER_FLTINCFG0_FLT3INEN);
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT3INSRC1);
            fltincfg0 |= (((faultcfg->source & 0x00000001U) << 26) & HRTIMER_FLTINCFG0_FLT3INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 18) & HRTIMER_FLTINCFG1_FLT3INSRC1);
            fltincfg0 |= ((faultcfg->polarity) << 24);
            fltincfg0 |= ((faultcfg->filter) << 27);
            fltincfg0 |= ((faultcfg->control) << 24);
            fltincfg0 |= ((faultcfg->protect) << 24);
            
            fltincfg2 &= ~(HRTIMER_FLTINCFG2_FLT3BLKEN | HRTIMER_FLTINCFG2_FLT3BLKS | HRTIMER_FLTINCFG2_FLT3CNT | HRTIMER_FLTINCFG2_FLT3RST);
            fltincfg2 |= ((faultcfg->blanksenable << 24) | (faultcfg->blanksource << 24) | (faultcfg->counter << 26) | (faultcfg->resetmode << 24));
        }
        break;
        case HRTIMER_FAULT_4:
        {
            /* configure fault input 4 */
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT4INP | HRTIMER_FLTINCFG1_FLT4INSRC0 |  HRTIMER_FLTINCFG1_FLT4INSRC1 | HRTIMER_FLTINCFG1_FLT4INFC | HRTIMER_FLTINCFG1_FLT4INPROT | HRTIMER_FLTINCFG1_FLT4INEN);
            fltincfg1 |= (((faultcfg->source & 0x00000001U) << 2) & HRTIMER_FLTINCFG1_FLT4INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 19) & HRTIMER_FLTINCFG1_FLT4INSRC1);
            fltincfg1 |= faultcfg->polarity;
            fltincfg1 |= ((faultcfg->filter) << 3);
            fltincfg1 |= (faultcfg->control);
            fltincfg1 |= faultcfg->protect;
            
            fltincfg3 &= ~(HRTIMER_FLTINCFG3_FLT4BLKEN | HRTIMER_FLTINCFG3_FLT4BLKS | HRTIMER_FLTINCFG3_FLT4CNT | HRTIMER_FLTINCFG3_FLT4RST);
            fltincfg3 |= (faultcfg->blanksenable | faultcfg->blanksource | (faultcfg->counter << 2) | faultcfg->resetmode);
        }
        break;
        case HRTIMER_FAULT_5:
        {
            /* configure fault input 5 */
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT5INP | HRTIMER_FLTINCFG1_FLT5INSRC0 | HRTIMER_FLTINCFG1_FLT5INSRC1 | HRTIMER_FLTINCFG1_FLT5INFC | HRTIMER_FLTINCFG1_FLT5INPROT | HRTIMER_FLTINCFG1_FLT5INEN);
            fltincfg1 |= (((faultcfg->source & 0x00000001U) << 10) & HRTIMER_FLTINCFG1_FLT5INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 20) & HRTIMER_FLTINCFG1_FLT5INSRC1);
            fltincfg1 |= (faultcfg->polarity << 8);
            fltincfg1 |= ((faultcfg->filter) << 11);
            fltincfg1 |= ((faultcfg->control) << 8);
            fltincfg1 |= ((faultcfg->protect) << 8);
            
            fltincfg3 &= ~(HRTIMER_FLTINCFG3_FLT5BLKEN | HRTIMER_FLTINCFG3_FLT5BLKS | HRTIMER_FLTINCFG3_FLT5CNT | HRTIMER_FLTINCFG3_FLT5RST);
            fltincfg3 |= ((faultcfg->blanksenable << 8) | (faultcfg->blanksource << 8) | (faultcfg->counter << 10) | (faultcfg->resetmode << 8));
        }
        break;
        case HRTIMER_FAULT_6:
        {
            /* configure fault input 6 */
            fltincfg4 &= ~( HRTIMER_FLTINCFG4_FLT6INP | HRTIMER_FLTINCFG4_FLT6INSRC0 | HRTIMER_FLTINCFG4_FLT6INFC | HRTIMER_FLTINCFG4_FLT6INPROT | HRTIMER_FLTINCFG4_FLT6INEN);
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT6INSRC1);
            fltincfg4 |= (((faultcfg->source & 0x00000001U) << 2) & HRTIMER_FLTINCFG4_FLT6INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 21) & HRTIMER_FLTINCFG1_FLT6INSRC1);
            fltincfg4 |= faultcfg->polarity;
            fltincfg4 |= ((faultcfg->filter) << 3);
            fltincfg4 |= faultcfg->control;
            fltincfg4 |= faultcfg->protect;
            
