wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
            fltincfg3 &= ~(HRTIMER_FLTINCFG3_FLT6BLKEN | HRTIMER_FLTINCFG3_FLT6BLKS | HRTIMER_FLTINCFG3_FLT6CNT | HRTIMER_FLTINCFG3_FLT6RST);
            fltincfg3 |= ((faultcfg->blanksenable << 16) | (faultcfg->blanksource << 16) | (faultcfg->counter << 18) | (faultcfg->resetmode << 16));
        }
        break;
        case HRTIMER_FAULT_7:
        {
            /* configure fault input 7 */
            fltincfg4 &= ~( HRTIMER_FLTINCFG4_FLT7INP | HRTIMER_FLTINCFG4_FLT7INSRC0 | HRTIMER_FLTINCFG4_FLT7INFC | HRTIMER_FLTINCFG4_FLT7INPROT | HRTIMER_FLTINCFG4_FLT7INEN );
            fltincfg1 &= ~( HRTIMER_FLTINCFG1_FLT7INSRC1);
            fltincfg4 |= (((faultcfg->source & 0x00000001U) << 10) & HRTIMER_FLTINCFG4_FLT7INSRC0);
            fltincfg1 |= (((faultcfg->source & 0x00000002U) << 22) & HRTIMER_FLTINCFG1_FLT7INSRC1);
            fltincfg4 |= ((faultcfg->polarity) << 8);
            fltincfg4 |= ((faultcfg->filter) << 11);
            fltincfg4 |= ((faultcfg->control) << 8);
            fltincfg4 |= ((faultcfg->protect) << 8);
            
            fltincfg3 &= ~(HRTIMER_FLTINCFG3_FLT7BLKEN | HRTIMER_FLTINCFG3_FLT7BLKS | HRTIMER_FLTINCFG3_FLT7CNT | HRTIMER_FLTINCFG3_FLT7RST);
            fltincfg3 |= ((faultcfg->blanksenable << 24) | (faultcfg->blanksource << 24) | (faultcfg->counter << 26) | (faultcfg->resetmode << 24));
        }
        break;
        default:
        break;
    }
    
    /* configure fault input configuration register except input enable bit and protect fault input configuration bit */
    HRTIMER_FLTINCFG2(hrtimer_periph) = fltincfg2;
    HRTIMER_FLTINCFG3(hrtimer_periph) = fltincfg3;
    HRTIMER_FLTINCFG0(hrtimer_periph) = (fltincfg0 & (~0x81818181U));
    HRTIMER_FLTINCFG1(hrtimer_periph) = (fltincfg1 & (~0x00008181U));
    HRTIMER_FLTINCFG4(hrtimer_periph) = (fltincfg4 & (~0x00008181U));
    
    /* configure fault input configuration register input enable bit */
    HRTIMER_FLTINCFG0(hrtimer_periph) |= (fltincfg0 & (0x01010101U));
    HRTIMER_FLTINCFG1(hrtimer_periph) |= (fltincfg1 & (0x00000101U));
    HRTIMER_FLTINCFG4(hrtimer_periph) |= (fltincfg4 & (0x00000101U));
    
    /* configure fault input configuration register protect fault input configuration bit */
    HRTIMER_FLTINCFG0(hrtimer_periph) |= (fltincfg0 & (0x80808080U)); 
    HRTIMER_FLTINCFG1(hrtimer_periph) |= (fltincfg1 & (0x00008080U));
    HRTIMER_FLTINCFG4(hrtimer_periph) |= (fltincfg4 & (0x00008080U));
    
    /* configure fault recovery control register fault recovery control configuration bit */
    HRTIMER_FLTRECCTL(hrtimer_periph) = faultcfg->fault_recovery_control;
}

/*!
    \brief      configure the fault input digital filter clock division
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  prescaler: clock division value
                only one parameter can be selected which is shown as below:
      \arg          HRTIMER_FAULT_PRESCALER_DIV1: fHRTIMER_FLTFCK = fHRTIMER_CK 
      \arg          HRTIMER_FAULT_PRESCALER_DIV2: fHRTIMER_FLTFCK = fHRTIMER_CK / 2 
      \arg          HRTIMER_FAULT_PRESCALER_DIV4: fHRTIMER_FLTFCK = fHRTIMER_CK / 4 
      \arg          HRTIMER_FAULT_PRESCALER_DIV8: fHRTIMER_FLTFCK = fHRTIMER_CK / 8 
    \param[out] none
    \retval     none
*/
void hrtimer_fault_prescaler_config(uint32_t hrtimer_periph, uint32_t prescaler)
{
    uint32_t fltincfg1;

    /* configure digital filter clock division */
    fltincfg1 = HRTIMER_FLTINCFG1(hrtimer_periph);
    fltincfg1 &= ~(HRTIMER_FLTINCFG1_FLTFDIV);
    fltincfg1 |= prescaler;
    HRTIMER_FLTINCFG1(hrtimer_periph) = fltincfg1;
}

/*!
    \brief      fault input enable
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  fault_id: HRTIMER_FAULT_y(y=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_fault_input_enable(uint32_t hrtimer_periph, uint32_t fault_id)
{
    uint32_t fltincfg0;
    uint32_t fltincfg1;
    uint32_t fltincfg4;
    
    fltincfg0 = HRTIMER_FLTINCFG0(hrtimer_periph);
    fltincfg1 = HRTIMER_FLTINCFG1(hrtimer_periph);
    fltincfg4 = HRTIMER_FLTINCFG4(hrtimer_periph);
    
    switch (fault_id)
    {
        case HRTIMER_FAULT_0:
        {
            /* configure fault input 0 */
            fltincfg0 |= HRTIMER_FLTINCFG0_FLT0INEN;
        }
        break;
        case HRTIMER_FAULT_1:
        {
            /* configure fault input 1 */
            fltincfg0 |= HRTIMER_FLTINCFG0_FLT1INEN;
        }
        break;
        case HRTIMER_FAULT_2:
        {
            /* configure fault input 2 */
            fltincfg0 |= HRTIMER_FLTINCFG0_FLT2INEN;
        }
        break;
        case HRTIMER_FAULT_3:
        {
            /* configure fault input 3 */
            fltincfg0 |= HRTIMER_FLTINCFG0_FLT3INEN;
        }
        break;
        case HRTIMER_FAULT_4:
        {
            /* configure fault input 4 */
            fltincfg1 |= HRTIMER_FLTINCFG1_FLT4INEN;
        }
        break;
        case HRTIMER_FAULT_5:
        {
            /* configure fault input 5 */
            fltincfg1 |= HRTIMER_FLTINCFG1_FLT5INEN;
        }
        break;
        case HRTIMER_FAULT_6:
        {
            /* configure fault input 6 */
            fltincfg4 |= HRTIMER_FLTINCFG4_FLT6INEN;
        }
        break;
        case HRTIMER_FAULT_7:
        {
            /* configure fault input 7 */
            fltincfg4 |= HRTIMER_FLTINCFG4_FLT7INEN;
        }
        break;
        default:
        break;
    }

    HRTIMER_FLTINCFG0(hrtimer_periph) = fltincfg0;
    HRTIMER_FLTINCFG1(hrtimer_periph) = fltincfg1;
    HRTIMER_FLTINCFG4(hrtimer_periph) = fltincfg4;
}

/*!
    \brief      fault input disable
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  fault_id: HRTIMER_FAULT_y(y=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_fault_input_disable(uint32_t hrtimer_periph, uint32_t fault_id)
{
    uint32_t fltincfg0;
    uint32_t fltincfg1;
    uint32_t fltincfg4;
    
    fltincfg0 = HRTIMER_FLTINCFG0(hrtimer_periph);
    fltincfg1 = HRTIMER_FLTINCFG1(hrtimer_periph);
    fltincfg4 = HRTIMER_FLTINCFG4(hrtimer_periph);
    
