wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    switch (fault_id)
    {
        case HRTIMER_FAULT_0:
        {
            /* configure fault input 0 */
            fltincfg0 &= ~HRTIMER_FLTINCFG0_FLT0INEN;
        }
        break;
        case HRTIMER_FAULT_1:
        {
            /* configure fault input 1 */
            fltincfg0 &= ~HRTIMER_FLTINCFG0_FLT1INEN;
        }
        break;
        case HRTIMER_FAULT_2:
        {
            /* configure fault input 2 */
            fltincfg0 &= ~HRTIMER_FLTINCFG0_FLT2INEN;
        }
        break;
        case HRTIMER_FAULT_3:
        {
            /* configure fault input 3 */
            fltincfg0 &= ~HRTIMER_FLTINCFG0_FLT3INEN;
        }
        break;
        case HRTIMER_FAULT_4:
        {
            /* configure fault input 4 */
            fltincfg1 &= ~HRTIMER_FLTINCFG1_FLT4INEN;
        }
        break;
        case HRTIMER_FAULT_5:
        {
            /* configure fault input 5 */
            fltincfg1 &= ~HRTIMER_FLTINCFG1_FLT5INEN;
        }
        break;
        case HRTIMER_FAULT_6:
        {
            /* configure fault input 6 */
            fltincfg4 &= ~HRTIMER_FLTINCFG4_FLT6INEN;
        }
        break;
        case HRTIMER_FAULT_7:
        {
            /* configure fault input 7 */
            fltincfg4 &= ~HRTIMER_FLTINCFG4_FLT7INEN;
        }
        break;
        default:
        break;
    }

    HRTIMER_FLTINCFG0(hrtimer_periph) = fltincfg0;
    HRTIMER_FLTINCFG1(hrtimer_periph) = fltincfg1;
    HRTIMER_FLTINCFG4(hrtimer_periph) = fltincfg4;
}

/*!
    \brief      fault input couter reset
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  fault_id: HRTIMER_FAULT_y(y=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_fault_counter_reset(uint32_t hrtimer_periph, uint32_t fault_id)
{
    switch (fault_id)
    {
        case HRTIMER_FAULT_0:
        {
            /* reset fault input 0 counter */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT0CNTRST;
        }
        break;
        case HRTIMER_FAULT_1:
        {
            /* reset fault input 1 counter */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT1CNTRST;
        }
        break;
        case HRTIMER_FAULT_2:
        {
            /* reset fault input 2 counter */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT2CNTRST;
        }
        break;
        case HRTIMER_FAULT_3:
        {
            /* reset fault input 3 counter */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT3CNTRST;
        }
        break;
        case HRTIMER_FAULT_4:
        {
            /* reset fault input 4 counter */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT4CNTRST;
        }
        break;
        case HRTIMER_FAULT_5:
        {
            /* reset fault input 5 counter */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT5CNTRST;
        }
        break;
        case HRTIMER_FAULT_6:
        {
            /* reset fault input 6 counter */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT6CNTRST;
        }
        break;
        case HRTIMER_FAULT_7:
        {
            /* reset fault input 7 counter */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT7CNTRST;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      fault input blank enable
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  fault_id: HRTIMER_FAULT_y(y=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_fault_blank_enable(uint32_t hrtimer_periph, uint32_t fault_id)
{
    switch (fault_id)
    {
        case HRTIMER_FAULT_0:
        {
            /* enable fault input 0 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT0BLKEN;
        }
        break;
        case HRTIMER_FAULT_1:
        {
            /* enable fault input 1 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT1BLKEN;
        }
        break;
        case HRTIMER_FAULT_2:
        {
            /* enable fault input 2 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT2BLKEN;
        }
        break;
        case HRTIMER_FAULT_3:
        {
            /* enable fault input 3 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) |= HRTIMER_FLTINCFG2_FLT3BLKEN;
        }
        break;
        case HRTIMER_FAULT_4:
        {
            /* enable fault input 4 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT4BLKEN;
        }
        break;
        case HRTIMER_FAULT_5:
        {
            /* enable fault input 5 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT5BLKEN;
        }
        break;
        case HRTIMER_FAULT_6:
        {
            /* enable fault input 6 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT6BLKEN;
        }
        break;
        case HRTIMER_FAULT_7:
        {
            /* enable fault input 7 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) |= HRTIMER_FLTINCFG3_FLT7BLKEN;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      fault input blank disable
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  fault_id: HRTIMER_FAULT_y(y=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_fault_blank_disable(uint32_t hrtimer_periph, uint32_t fault_id)
{
    switch (fault_id)
    {
        case HRTIMER_FAULT_0:
        {
            /* disable fault input 0 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) &= ~HRTIMER_FLTINCFG2_FLT0BLKEN;
        }
        break;
        case HRTIMER_FAULT_1:
        {
            /* disable fault input 1 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) &= ~HRTIMER_FLTINCFG2_FLT1BLKEN;
        }
        break;
        case HRTIMER_FAULT_2:
        {
            /* disable fault input 2 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) &= ~HRTIMER_FLTINCFG2_FLT2BLKEN;
        }
        break;
        case HRTIMER_FAULT_3:
        {
            /* disable fault input 3 blank */
            HRTIMER_FLTINCFG2(hrtimer_periph) &= ~HRTIMER_FLTINCFG2_FLT3BLKEN;
        }
        break;
        case HRTIMER_FAULT_4:
        {
            /* disable fault input 4 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) &= ~HRTIMER_FLTINCFG3_FLT4BLKEN;
        }
        break;
        case HRTIMER_FAULT_5:
        {
            /* disable fault input 5 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) &= ~HRTIMER_FLTINCFG3_FLT5BLKEN;
        }
        break;
        case HRTIMER_FAULT_6:
        {
            /* disable fault input 6 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) &= ~HRTIMER_FLTINCFG3_FLT6BLKEN;
        }
        break;
        case HRTIMER_FAULT_7:
        {
            /* disable fault input 7 blank */
            HRTIMER_FLTINCFG3(hrtimer_periph) &= ~HRTIMER_FLTINCFG3_FLT7BLKEN;
        }
        break;
        default:
        break;
    }
}
/*!
    \brief      enable the Master_TIMER and Slave_TIMER DMA request
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  dmareq: DMA request source
                only one parameter can be selected which is shown as below:
      \arg          HRTIMER_MT_ST_DMA_CMP0: compare 0 DMA request, for Master_TIMER and Slave_TIMER
      \arg          HRTIMER_MT_ST_DMA_CMP1: compare 1 DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_ST_DMA_CMP2: compare 2 DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_ST_DMA_CMP3: compare 3 DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_ST_DMA_REP: repetition DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_DMA_SYNID: synchronization input DMA request, for Master_TIMER 
      \arg          HRTIMER_MT_ST_DMA_UPD: update DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_ST_DMA_CAP0: capture 0 DMA request, for Slave_TIMER 
      \arg          HRTIMER_ST_DMA_CAP0: capture 1 DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH0OA: channel 0 output active DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH0ONA: channel 0 output inactive DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH1OA: channel 1 output active DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH1ONA: channel 1 output inactive DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CNTRST: counter reset DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_DLYIDLE: delay IDLE DMA request, for Slave_TIMER  
    \param[out] none
    \retval     none
*/
void hrtimer_timers_dma_enable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t dmareq)
{
    switch(timer_id)
    {
        /* enable the Master_TIMER request */
        case HRTIMER_MASTER_TIMER:
            HRTIMER_MTDMAINTEN(hrtimer_periph) |= dmareq;
        break;
        /* enable the Slave_TIMER DMA request */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            HRTIMER_STXDMAINTEN(hrtimer_periph, timer_id) |= dmareq;
        break;
        
        default:
        break;  
    }
}

/*!
    \brief      disable the Master_TIMER and Slave_TIMER DMA request
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  dmareq: DMA request source
                only one parameter can be selected which is shown as below:
      \arg          HRTIMER_MT_ST_DMA_CMP0: compare 0 DMA request, for Master_TIMER and Slave_TIMER
      \arg          HRTIMER_MT_ST_DMA_CMP1: compare 1 DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_ST_DMA_CMP2: compare 2 DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_ST_DMA_CMP3: compare 3 DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_ST_DMA_REP: repetition DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_MT_DMA_SYNID: synchronization input DMA request, for Master_TIMER 
      \arg          HRTIMER_MT_ST_DMA_UPD: update DMA request, for Master_TIMER and Slave_TIMER 
      \arg          HRTIMER_ST_DMA_CAP0: capture 0 DMA request, for Slave_TIMER 
      \arg          HRTIMER_ST_DMA_CAP0: capture 1 DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH0OA: channel 0 output active DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH0ONA: channel 0 output inactive DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH1OA: channel 1 output active DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CH1ONA: channel 1 output inactive DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_CNTRST: counter reset DMA request, for Slave_TIMER  
      \arg          HRTIMER_ST_DMA_DLYIDLE: delay IDLE DMA request, for Slave_TIMER  
    \param[out] none
    \retval     none
*/
void hrtimer_timers_dma_disable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t dmareq)
{
    switch(timer_id)
    {
        /* disable the Master_TIMER request */
        case HRTIMER_MASTER_TIMER:
            HRTIMER_MTDMAINTEN(hrtimer_periph) &= ~dmareq;
        break;
        /* disable the Slave_TIMER request */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            HRTIMER_STXDMAINTEN(hrtimer_periph, timer_id) &= ~dmareq;
        break;
        
        default:
        break;  
    }
}

/*!
    \brief      configure the DMA mode for Master_TIMER or Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  regupdate: registers to be updated
                one or more parameters can be selected which is shown as below:
      \arg         HRTIMER_DMAMODE_NONE: No register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CTL0: MTCTL0 or STxCTL0 register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_INTC: MT or STx register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_DMAINTEN: MTINTC or STxINTC register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CNT: MTCNT or STxCNT register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CAR: MTCAR or STxCAR register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CREP: MTCREP or STxCREP register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CMP0V: MTCMP0V or STxCMP0V register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CMP1V: MTCMP1V or STxCMP1V register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CMP2V: MTCMP2V or STxCMP2V register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_CMP3V: MTCMP3V or STxCMP3V register is updated by DMA mode, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_DMAMODE_DTCTL: STxDTCTL register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CH0SET: STxCH0SET register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CH0RST: STxCH0RST register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CH1SET: STxCH1SET register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CH1RST: STxCH1RST register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_EXEVFCFG0: STxEXEVFCFG0 register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_EXEVFCFG1: STxEXEVFCFG1 register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CNTRST: STxCNTRST register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CSCTL: STxCSCTL register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CHOCTL: STxCHOCTL register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_FLTCTL: STxFLTCTL register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_CTL1: STxCTL1 register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_EXEVFCFG2: STxEXEVFCFG2 register is updated by DMA mode, only for Slave_TIMER
      \arg         HRTIMER_DMAMODE_ACTL: STxACTL register is updated by DMA mode, only for Slave_TIMER
    \param[out] none
    \retval     none
*/
void hrtimer_dmamode_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t regupdate)
{
    switch (timer_id) 
    {
        /* set the DMA mode update Slave_TIMER0 registers */
        case HRTIMER_SLAVE_TIMER0:
        {
            HRTIMER_DMAUPST0R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER1 registers */
        case HRTIMER_SLAVE_TIMER1:
        {
            HRTIMER_DMAUPST1R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER2 registers */
        case HRTIMER_SLAVE_TIMER2:
        {
            HRTIMER_DMAUPST2R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER3 registers */
        case HRTIMER_SLAVE_TIMER3:
        {
            HRTIMER_DMAUPST3R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER4 registers */
        case HRTIMER_SLAVE_TIMER4:
        {
            HRTIMER_DMAUPST4R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER5 registers */
        case HRTIMER_SLAVE_TIMER5:
        {
            HRTIMER_DMAUPST5R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER6 registers */
        case HRTIMER_SLAVE_TIMER6:
        {
            HRTIMER_DMAUPST6R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Slave_TIMER7 registers */
        case HRTIMER_SLAVE_TIMER7:
        {
            HRTIMER_DMAUPST7R(hrtimer_periph) = regupdate;
        }
        break;
        /* set the DMA mode update Master_TIMER registers */
        case HRTIMER_MASTER_TIMER:
        {
            HRTIMER_DMAUPMTR(hrtimer_periph) = regupdate;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      initialize bunch mode configuration struct with a default value
    \param[in]  bmcfg: bunch mode configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_bunchmode_struct_para_init(hrtimer_bunchmode_parameter_struct* bmcfg)
{
    bmcfg->clock_source = HRTIMER_BUNCHMODE_CLOCKSOURCE_MASTER;
    bmcfg->idle_duration = 0U;
    bmcfg->mode = HRTIMER_BUNCHMODE_SINGLE;
    bmcfg->period = 0U;
    bmcfg->prescaler = HRTIMER_BUNCHMODE_PRESCALER_DIV1;
    bmcfg->shadow = HRTIMER_BUNCHMODEPRELOAD_DISABLED;
    bmcfg->trigger[0] = HRTIMER_BUNCHMODE_TRIGGER_NONE;
    bmcfg->trigger[1] = HRTIMER_BUNCHMODE_TRIGGER_NONE;
}

/*!
    \brief      configure bunch mode for the HRTIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  bmcfg: bunch mode configuration struct
                  mode: HRTIMER_BUNCHMODE_SINGLE, HRTIMER_BUNCHMODE_CONTINOUS
                  clock_source: HRTIMER_BUNCHMODE_CLOCKSOURCE_MASTER, HRTIMER_BUNCHMODE_CLOCKSOURCE_STy(y=0..7), HRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER15_CH0_O,
                           HRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER16_CH0_O,HRTIMER_BUNCHMODE_CLOCKSOURCE_TIMER6_TRGO,
                           HRTIMER_BUNCHMODE_CLOCKSOURCE_HRTIMERCK
                  prescaler: HRTIMER_BUNCHMODE_PRESCALER_DIVy(y=1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768)
                  shadow: HRTIMER_BUNCHMODEPRELOAD_DISABLED, HRTIMER_BUNCHMODEPRELOAD_ENABLED
                  trigger[2]: HRTIMER_BUNCHMODE_TRIGGER_NONE, HRTIMER_BUNCHMODE_TRIGGER_MTRESET, HRTIMER_BUNCHMODE_TRIGGER_MTREPETITION, HRTIMER_BUNCHMODE_TRIGGER_MTCMPy(y=0..3),
                           HRTIMER_BUNCHMODE_TRIGGER_STxRESET(x=0..7), HRTIMER_BUNCHMODE_TRIGGER_STxREPETITION(x=0..7), HRTIMER_BUNCHMODE_TRIGGER_STxCMPy(x=0..7, y=0,1), HRTIMER_BUNCHMODE_TRIGGER_ST0EVENT6,
                           HRTIMER_BUNCHMODE_TRIGGER_ST3EVENT7, HRTIMER_BUNCHMODE_TRIGGER_EVENT6, HRTIMER_BUNCHMODE_TRIGGER_EVENT7, HRTIMER_BUNCHMODE_TRIGGER_CHIP
                  idle_duration: 0x0000~0xFFFF
                  period: 0x0001~0xFFFF
    \param[out] none
    \retval     none
*/
void hrtimer_bunchmode_config(uint32_t hrtimer_periph, hrtimer_bunchmode_parameter_struct* bmcfg)
{
    uint32_t bmctl_reg;

