wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    bmctl_reg = HRTIMER_BMCTL(hrtimer_periph);

    /* set the bunch mode operating mode */
    bmctl_reg &= ~(HRTIMER_BMCTL_BMCTN);
    bmctl_reg |= bmcfg->mode;
    
    /* set the bunch mode clock source */
    bmctl_reg &= ~(HRTIMER_BMCTL_BMCLKS);
    bmctl_reg |= bmcfg->clock_source;
  
    /* set the bunch mode prescaler */
    bmctl_reg &= ~(HRTIMER_BMCTL_BMPSC);
    bmctl_reg |= bmcfg->prescaler;
 
    /* enable/disable bunch mode shadow registers */
    bmctl_reg &= ~(HRTIMER_BMCTL_BMSE);
    bmctl_reg |= bmcfg->shadow;
 
    /* set the bunch mode trigger */
    HRTIMER_BMSTRG(hrtimer_periph)  = (uint32_t)bmcfg->trigger[0] ;
    HRTIMER_BMSTRGA(hrtimer_periph) = (uint32_t)bmcfg->trigger[1] ;
  
    /* set the bunch mode compare value */
    HRTIMER_BMCMPV(hrtimer_periph) = bmcfg->idle_duration;
    
    /* set the bunch mode period */
    HRTIMER_BMCAR(hrtimer_periph) = bmcfg->period;
   
    HRTIMER_BMCTL(hrtimer_periph) = bmctl_reg;
}

/*!
    \brief      enable bunch mode for the HRTIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[out] none
    \retval     none
*/
void hrtimer_bunchmode_enable(uint32_t hrtimer_periph)
{
    HRTIMER_BMCTL(hrtimer_periph) |= HRTIMER_BMCTL_BMEN;
}

/*!
    \brief      disable bunch mode for the HRTIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[out] none
    \retval     none
*/
void hrtimer_bunchmode_disable(uint32_t hrtimer_periph)
{
    HRTIMER_BMCTL(hrtimer_periph) &= ~HRTIMER_BMCTL_BMEN;
}

/*!
    \brief      get bunch mode operating flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[out] none
    \retval     bunch mode operating state
*/
uint32_t hrtimer_bunchmode_flag_get(uint32_t hrtimer_periph)
{
    uint32_t val = HRTIMER_BUNCHMODE_OPERATION_OFF;
    /* judge bunch mode operating state */
    if(RESET != (HRTIMER_BMCTL(hrtimer_periph) & HRTIMER_BMCTL_BMOPTF)){
        val = HRTIMER_BUNCHMODE_OPERATION_ON;
    }else{
        val = HRTIMER_BUNCHMODE_OPERATION_OFF;
    }
    return val;
}

/*!
    \brief      bunch mode started by software
    \param[in]  hrtimer_periph: HRTIMER0
    \param[out] none
    \retval     bunch mode operating state
*/
void hrtimer_bunchmode_software_start(uint32_t hrtimer_periph)
{
    HRTIMER_BMSTRG(hrtimer_periph) |= HRTIMER_BMSTRG_SWTRG;
}

/*!
    \brief      configure the capture source in Slave_TIMER
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  capturex: HRTIMER_CAPTURE_y(y=0, 1)
    \param[in]  trgsource: capture source
                one or more parameters can be selected which is shown as below:
      \arg         HRTIMER_CAPTURETRIGGER_NONE: Capture trigger is disabled
      \arg         HRTIMER_CAPTURETRIGGER_UPDATE: capture triggered by update event
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_0: capture triggered by external event 0
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_1: capture triggered by external event 1
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_2: capture triggered by external event 2
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_3: capture triggered by external event 3
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_4: capture triggered by external event 4
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_5: capture triggered by external event 5
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_6: capture triggered by external event 6
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_7: capture triggered by external event 7
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_8: capture triggered by external event 8
      \arg         HRTIMER_CAPTURETRIGGER_EXEV_9: capture triggered by external event 9
      \arg         HRTIMER_CAPTURETRIGGER_ST0_ACTIVE: capture triggered by ST0CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST0_INACTIVE: capture triggered by ST0CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST0_CMP0: capture triggered by compare 0 event of Slave_TIMER0
      \arg         HRTIMER_CAPTURETRIGGER_ST0_CMP1: capture triggered by compare 1 event of Slave_TIMER0
      \arg         HRTIMER_CAPTURETRIGGER_ST1_ACTIVE: capture triggered by ST1CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST1_INACTIVE: capture triggered by ST1CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST1_CMP0: capture triggered by compare 0 event of Slave_TIMER1
      \arg         HRTIMER_CAPTURETRIGGER_ST1_CMP1: capture triggered by compare 1 event of Slave_TIMER1
      \arg         HRTIMER_CAPTURETRIGGER_ST2_ACTIVE: capture triggered by ST2CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST2_INACTIVE: capture triggered by ST2CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST2_CMP0: capture triggered by compare 0 event of Slave_TIMER2
      \arg         HRTIMER_CAPTURETRIGGER_ST2_CMP1: capture triggered by compare 1 event of Slave_TIMER2
      \arg         HRTIMER_CAPTURETRIGGER_ST3_ACTIVE: capture triggered by ST3CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST3_INACTIVE: capture triggered by ST3CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST3_CMP0: capture triggered by compare 0 event of Slave_TIMER3
      \arg         HRTIMER_CAPTURETRIGGER_ST3_CMP1: capture triggered by compare 1 event of Slave_TIMER3
      \arg         HRTIMER_CAPTURETRIGGER_ST4_ACTIVE: capture triggered by ST4CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST4_INACTIVE: capture triggered by ST4CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST4_CMP0: capture triggered by compare 0 event of Slave_TIMER4
      \arg         HRTIMER_CAPTURETRIGGER_ST4_CMP1: capture triggered by compare 1 event of Slave_TIMER4
      \arg         HRTIMER_CAPTURETRIGGER_ST5_ACTIVE: capture triggered by ST5CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST5_INACTIVE: capture triggered by ST5CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST5_CMP0: capture triggered by compare 0 event of Slave_TIMER5
      \arg         HRTIMER_CAPTURETRIGGER_ST5_CMP1: capture triggered by compare 1 event of Slave_TIMER5
      \arg         HRTIMER_CAPTURETRIGGER_ST6_ACTIVE: capture triggered by ST6CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST6_INACTIVE: capture triggered by ST6CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST6_CMP0: capture triggered by compare 0 event of Slave_TIMER6
      \arg         HRTIMER_CAPTURETRIGGER_ST6_CMP1: capture triggered by compare 1 event of Slave_TIMER6
      \arg         HRTIMER_CAPTURETRIGGER_ST7_ACTIVE: capture triggered by ST7CH0_O output inactive to active transition
      \arg         HRTIMER_CAPTURETRIGGER_ST7_INACTIVE: capture triggered by ST7CH0_O output active to inactive transition
      \arg         HRTIMER_CAPTURETRIGGER_ST7_CMP0: capture triggered by compare 0 event of Slave_TIMER7
      \arg         HRTIMER_CAPTURETRIGGER_ST7_CMP1: capture triggered by compare 1 event of Slave_TIMER7
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_capture_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t capturex, uint64_t trgsource)
{
    uint32_t stxcaptrgcom_reg;

