wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    /* get the value of registers */
    stxcaptrgcom_reg = HRTIMER_STXCAPTRGCOM(hrtimer_periph, timer_id);
    
    switch (capturex)
    {
        /* configure the capture 0 unit */
        case HRTIMER_CAPTURE_0:
        {
            /* configure the Slave_TIMER capture 0 trigger event in HRTIMER_STXCAP0TRG register */
            HRTIMER_STXCAP0TRG(hrtimer_periph, timer_id) = (uint32_t)trgsource;
            /* configure the Slave_TIMER capture 0 trigger event in HRTIMER_STXCAPTRGCOM register */
            stxcaptrgcom_reg &= ~0x0000FFFFU;
            stxcaptrgcom_reg |= (uint32_t)(trgsource >> 32U);
            HRTIMER_STXCAPTRGCOM(hrtimer_periph, timer_id) = stxcaptrgcom_reg;
        }
        break;
        /* configure the capture 1 unit */
        case HRTIMER_CAPTURE_1:
        {
            /* configure the Slave_TIMER capture 1 trigger event in HRTIMER_STXCAP1TRG register */
            HRTIMER_STXCAP1TRG(hrtimer_periph, timer_id) = (uint32_t)trgsource;
            /* configure the Slave_TIMER capture 1 trigger event in HRTIMER_STXCAPTRGCOM register */
            stxcaptrgcom_reg &= ~0xFFFF0000U;
            stxcaptrgcom_reg |= (uint32_t)((trgsource & 0xFFFFFFFF00000000U) >> 16U);
            HRTIMER_STXCAPTRGCOM(hrtimer_periph, timer_id) = stxcaptrgcom_reg;
        }
        break;
        default:
        break;
  }
}

/*!
    \brief      configure the capture source in Slave_TIMER  
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  capturex: HRTIMER_CAPTURE_y(y=0, 1)
    \param[out] none
    \retval     none
*/
void hrtimer_slavetimer_capture_software(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t capturex)
{
    switch (capturex)
    {
        /* configure the capture 0 unit */
        case HRTIMER_CAPTURE_0:
        {
            HRTIMER_STXCAP0TRG(hrtimer_periph, timer_id) |= HRTIMER_STXCAP0TRG_CP0BSW;
        }
        break;
        /* configure the capture 1 unit */
        case HRTIMER_CAPTURE_1:
        {
            HRTIMER_STXCAP1TRG(hrtimer_periph, timer_id) |= HRTIMER_STXCAP1TRG_CP1BSW;
        }
        break;
        default:
        break;
  }
}

/*!
    \brief      read the capture value 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  capturex: HRTIMER_CAPTURE_y(y=0, 1)
    \param[out] none
    \retval     capture value
*/
hrtimer_capture_value_struct hrtimer_slavetimer_capture_value_read(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t capturex)
{
    uint32_t cap_val = 0U;
    hrtimer_capture_value_struct captured;
    
    switch (capturex)
    {
        /* read capture 0 value */
        case HRTIMER_CAPTURE_0:
        {
          cap_val        = HRTIMER_STXCAP0V(hrtimer_periph, timer_id) ;
          captured.value = cap_val & 0xFFFFU ;
          captured.dir   = (uint32_t)((cap_val &= HRTIMER_STXCAP0V_DIR) >> 16U);
        }
        break;
        /* read capture 1 value */
        case HRTIMER_CAPTURE_1:
        {
          cap_val        = HRTIMER_STXCAP1V(hrtimer_periph, timer_id) ;
          captured.value = cap_val & 0xFFFFU ;
          captured.dir   = (uint32_t)((cap_val &= HRTIMER_STXCAP1V_DIR) >> 16U);
        }
        break;
        default:
        break;
    }
  
    return captured; 
}

/*!
    \brief      initialize ADC trigger configuration struct with a default value
    \param[in]  triggercfg: ADC trigger configuration struct
    \param[out] none
    \retval     none
*/
void hrtimer_adctrigcfg_struct_para_init(hrtimer_adctrigcfg_parameter_struct* triggercfg)
{
    triggercfg->trigger0_3[0] = HRTIMER_ADCTRGI02_EVENT_NONE;
    triggercfg->trigger0_3[1] = HRTIMER_ADCTRGI02_EVENT_NONE;
    triggercfg->trigger4_9 = HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMP0;
    triggercfg->update_source = HRTIMER_ADCTRGI_UPDATE_MT;
}

/*!
    \brief      configure the trigger source to ADC and the update source(0..3)
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  trigger_id: HRTIMER_ADCTRIG_y(y=0..3)
    \param[in]  triggercfg: ADC trigger configuration struct
                  update_source: HRTIMER_ADCTRGI_UPDATE_MT, HRTIMER_ADCTRGI_UPDATE_STx(x=0..7)
                  trigger0_3: 
                    for HRTIMER_ADCTRIG_0 and HRTIMER_ADCTRIG_2:
                           HRTIMER_ADCTRGI02_EVENT_NONE, HRTIMER_ADCTRGI02_EVENT_MTCMPy(y=0..3),
                           HRTIMER_ADCTRGI02_EVENT_MTPER, HRTIMER_ADCTRGI02_EVENT_EXEVy(y=0..4),
                           HRTIMER_ADCTRGI02_EVENT_STxCMPy(x=0..7,y=1..3), 
                           HRTIMER_ADCTRGI02_EVENT_STxPER(x=0..7), HRTIMER_ADCTRGI02_EVENT_STxRST(x=0..7)
                    for HRTIMER_ADCTRIG_1 and HRTIMER_ADCTRIG_3:
                           HRTIMER_ADCTRGI13_EVENT_NONE, HRTIMER_ADCTRGI13_EVENT_MTCMPy(y=0..3), 
                           HRTIMER_ADCTRGI13_EVENT_MTPER,HRTIMER_ADCTRGI13_EVENT_EXEVy(y=5..9),
                           HRTIMER_ADCTRGI13_EVENT_STxCMPy(x=0..7, y=1..3),
                           HRTIMER_ADCTRGI13_EVENT_STxPER(x=0..7), HRTIMER_ADCTRGI13_EVENT_STxRST(x=0..7)
    \param[out] none
    \retval     none
*/
void hrtimer_adc_trigger0_3_config(uint32_t hrtimer_periph, uint32_t trigger_id, hrtimer_adctrigcfg_parameter_struct* triggercfg)
{
    uint32_t comctl0_reg;
    
    comctl0_reg = HRTIMER_CTL0(hrtimer_periph);
    switch (trigger_id)
    {
        /* configure the ADC trigger 0 */
        case HRTIMER_ADCTRIG_0:
        {
            /* configure update source */
            comctl0_reg &= (uint32_t)(~(HRTIMER_CTL0_ADTG0USRC0_2 | HRTIMER_CTL0_ADTG0USRC3));
            comctl0_reg |= ((triggercfg->update_source & 0x7U) << 16U);
            comctl0_reg |= ((triggercfg->update_source & 0x8U) << 25U);
            /* set the HRTIMER_ADCTRIG0 source */
            HRTIMER_ADCTRIGS0(hrtimer_periph)  = (uint32_t)triggercfg->trigger0_3[0];
            HRTIMER_ADCTRIGS0A(hrtimer_periph) = (uint32_t)triggercfg->trigger0_3[1]; 
        }
        break;
        /* configure the ADC trigger 1 */
        case HRTIMER_ADCTRIG_1:
        {
            /* configure update source */
            comctl0_reg &= (uint32_t)(~(HRTIMER_CTL0_ADTG1USRC0_2 | HRTIMER_CTL0_ADTG1USRC3 ));
            comctl0_reg |= ((triggercfg->update_source & 0x7U) << 19U);
            comctl0_reg |= ((triggercfg->update_source & 0x8U) << 26U);
          
            /* set the HRTIMER_ADCTRIG1 source */
            HRTIMER_ADCTRIGS1(hrtimer_periph)  = (uint32_t)triggercfg->trigger0_3[0];
            HRTIMER_ADCTRIGS1A(hrtimer_periph) = (uint32_t)triggercfg->trigger0_3[1];  
        }
        break;
        /* configure the ADC trigger 2 */
        case HRTIMER_ADCTRIG_2:
        {
            /* configure update source */
            comctl0_reg &= (uint32_t)(~(HRTIMER_CTL0_ADTG2USRC0_2 | HRTIMER_CTL0_ADTG2USRC3 ));
            comctl0_reg |= ((triggercfg->update_source & 0x7U) << 22U);
            comctl0_reg |= ((triggercfg->update_source & 0x8U) << 27U);
          
            /* set the HRTIMER_ADCTRIG2 source */
            HRTIMER_ADCTRIGS2(hrtimer_periph)  = (uint32_t)triggercfg->trigger0_3[0];
            HRTIMER_ADCTRIGS2A(hrtimer_periph) = (uint32_t)triggercfg->trigger0_3[1];  
        }
        break;
        /* configure the ADC trigger 3 */
        case HRTIMER_ADCTRIG_3:
        {
            /* configure update source */
            comctl0_reg &= (uint32_t)(~(HRTIMER_CTL0_ADTG3USRC0_2 | HRTIMER_CTL0_ADTG3USRC3 ));
            comctl0_reg |= ((triggercfg->update_source & 0x7U) << 25U);
            comctl0_reg |= ((triggercfg->update_source & 0x8U) << 28U);
          
            /* set the HRTIMER_ADCTRIG3 source */
            HRTIMER_ADCTRIGS3(hrtimer_periph)  = (uint32_t)triggercfg->trigger0_3[0];
            HRTIMER_ADCTRIGS3A(hrtimer_periph) = (uint32_t)triggercfg->trigger0_3[1];  
        }
        break;
        
        default:
        break;
    }
    
    HRTIMER_CTL0(hrtimer_periph) = comctl0_reg;
}

/*!
    \brief      configure the trigger source to ADC and the update source(4..9)
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  trigger_id: HRTIMER_ADCTRIG_y(y=4..9)
    \param[in]  triggercfg: ADC trigger configuration struct
                  update_source: HRTIMER_ADCTRGI_UPDATE_MT, HRTIMER_ADCTRGI_UPDATE_STx(x=0..7)
                  trigger4_9: 
                    for HRTIMER_ADCTRIG_4,HRTIMER_ADCTRIG_6,HRTIMER_ADCTRIG_8:
                           HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMP0, HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_CMPy(y=0..3), 
                           HRTIMER_ADC_EXT_TRIG_468_BY_MASTER_PERIOD, HRTIMER_ADC_EXT_TRIG_468_BY_EXEV_y(y=0..4), 
                           HRTIMER_ADC_EXT_TRIG_468_BY_STx_CMPy(x=0..7,y=1..3), 
                           HRTIMER_ADC_EXT_TRIG_468_BY_STx_PERIOD(x=0..7), HRTIMER_ADC_EXT_TRIG_468_BY_STx_RESET(x=0,7)
                    for HRTIMER_ADCTRIG_5,HRTIMER_ADCTRIG_7,HRTIMER_ADCTRIG_9:
                           HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_CMP0, HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_CMPy(y=0..3), 
                           HRTIMER_ADC_EXT_TRIG_579_BY_MASTER_PERIOD, HRTIMER_ADC_EXT_TRIG_579_BY_EXEV_y(y=5..9), 
                           HRTIMER_ADC_EXT_TRIG_579_BY_STx_CMPy(x=0..7,y=1..3), 
                           HRTIMER_ADC_EXT_TRIG_579_BY_STx_PERIOD(x=0..7), HRTIMER_ADC_EXT_TRIG_579_BY_STx_RESET(x=0,7)
    \param[out] none
    \retval     none
*/
void hrtimer_adc_trigger4_9_config(uint32_t hrtimer_periph, uint32_t trigger_id, hrtimer_adctrigcfg_parameter_struct* triggercfg)
{
    uint32_t adctrgupd = 0U;
    uint32_t adcexttrg_reg = 0U;
    uint32_t adcexttrga_reg = 0U;
    switch (trigger_id)
    {
        /* configure the ADC trigger 4 */
        case HRTIMER_ADCTRIG_4:
        {
            /* configure update source */
            adctrgupd &= (uint32_t)(~HRTIMER_ADCTRGUPD_ADTG4USRC);
            adctrgupd |= triggercfg->update_source;
            HRTIMER_ADCTRGUPD(hrtimer_periph) = adctrgupd;
            
            /* set the HRTIMER_ADCTRIG4 source */
            adcexttrg_reg = HRTIMER_ADCEXTTRG(hrtimer_periph);
            adcexttrg_reg &= ~(HRTIMER_ADCEXTTRG_ADC4TRG4_0);
            adcexttrg_reg |= ((triggercfg->trigger4_9)&0x0000001FU);
            HRTIMER_ADCEXTTRG(hrtimer_periph) = adcexttrg_reg;

            adcexttrga_reg = HRTIMER_ADCEXTTRGA(hrtimer_periph);
            adcexttrga_reg &= ~(HRTIMER_ADCEXTTRGA_ADC4TRG5);
            adcexttrga_reg |= (triggercfg->trigger4_9 >> 5U);
            HRTIMER_ADCEXTTRGA(hrtimer_periph) = adcexttrga_reg;
        }
        break;
        /* configure the ADC trigger 5 */
        case HRTIMER_ADCTRIG_5:
        {
            /* configure update source */
            adctrgupd &= (uint32_t)(~HRTIMER_ADCTRGUPD_ADTG5USRC);
            adctrgupd |= ((triggercfg->update_source) << 4U);
            HRTIMER_ADCTRGUPD(hrtimer_periph) = adctrgupd;
            
            /* set the HRTIMER_ADCTRIG4 source */
            adcexttrg_reg = HRTIMER_ADCEXTTRG(hrtimer_periph);
            adcexttrg_reg &= ~(HRTIMER_ADCEXTTRG_ADC5TRG4_0);
            adcexttrg_reg |= ((triggercfg->trigger4_9 & 0x0000001FU) << 5U);
            HRTIMER_ADCEXTTRG(hrtimer_periph) = adcexttrg_reg;

            adcexttrga_reg = HRTIMER_ADCEXTTRGA(hrtimer_periph);
            adcexttrga_reg &= ~(HRTIMER_ADCEXTTRGA_ADC4TRG5);
            adcexttrga_reg |= ((triggercfg->trigger4_9 >> 5U) << 1U);
            HRTIMER_ADCEXTTRGA(hrtimer_periph) = adcexttrga_reg;
        }
        break;
        /* configure the ADC trigger 6 */
        case HRTIMER_ADCTRIG_6:
        {
            /* configure update source */
            adctrgupd &= (uint32_t)(~HRTIMER_ADCTRGUPD_ADTG6USRC);
            adctrgupd |= triggercfg->update_source << 8U;
            HRTIMER_ADCTRGUPD(hrtimer_periph) = adctrgupd;
            
