wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
            /* set the HRTIMER_ADCTRIG6 source */
            adcexttrg_reg = HRTIMER_ADCEXTTRG(hrtimer_periph);
            adcexttrg_reg &= ~(HRTIMER_ADCEXTTRG_ADC6TRG4_0);
            adcexttrg_reg |= ((triggercfg->trigger4_9 & 0x0000001FU) << 10U);
            HRTIMER_ADCEXTTRG(hrtimer_periph) = adcexttrg_reg;

            adcexttrga_reg = HRTIMER_ADCEXTTRGA(hrtimer_periph);
            adcexttrga_reg &= ~(HRTIMER_ADCEXTTRGA_ADC4TRG5);
            adcexttrga_reg |= ((triggercfg->trigger4_9 >> 5U) << 2U);
            HRTIMER_ADCEXTTRGA(hrtimer_periph) = adcexttrga_reg;
        }
        break;
        /* configure the ADC trigger 7 */
        case HRTIMER_ADCTRIG_7:
        {
            /* configure update source */
            adctrgupd &= (uint32_t)(~HRTIMER_ADCTRGUPD_ADTG7USRC);
            adctrgupd |= triggercfg->update_source << 12U;
            HRTIMER_ADCTRGUPD(hrtimer_periph) = adctrgupd;

            /* set the HRTIMER_ADCTRIG7 source */
            adcexttrg_reg = HRTIMER_ADCEXTTRG(hrtimer_periph);
            adcexttrg_reg &= ~(HRTIMER_ADCEXTTRG_ADC7TRG4_0);
            adcexttrg_reg |= ((triggercfg->trigger4_9 & 0x0000001FU) << 16U);
            HRTIMER_ADCEXTTRG(hrtimer_periph) = adcexttrg_reg;

            adcexttrga_reg = HRTIMER_ADCEXTTRGA(hrtimer_periph);
            adcexttrga_reg &= ~(HRTIMER_ADCEXTTRGA_ADC4TRG5);
            adcexttrga_reg |= ((triggercfg->trigger4_9 >> 5U) << 3U);
            HRTIMER_ADCEXTTRGA(hrtimer_periph) = adcexttrga_reg;
        }
        break;
        /* configure the ADC trigger 8 */
        case HRTIMER_ADCTRIG_8:
        {
            /* configure update source */
            adctrgupd &= (uint32_t)(~HRTIMER_ADCTRGUPD_ADTG8USRC);
            adctrgupd |= triggercfg->update_source << 16U;
            HRTIMER_ADCTRGUPD(hrtimer_periph) = adctrgupd;
            
            /* set the HRTIMER_ADCTRIG8 source */
            adcexttrg_reg = HRTIMER_ADCEXTTRG(hrtimer_periph);
            adcexttrg_reg &= ~(HRTIMER_ADCEXTTRG_ADC8TRG4_0);
            adcexttrg_reg |= ((triggercfg->trigger4_9 & 0x0000001FU) << 21U);
            HRTIMER_ADCEXTTRG(hrtimer_periph) = adcexttrg_reg;

            adcexttrga_reg = HRTIMER_ADCEXTTRGA(hrtimer_periph);
            adcexttrga_reg &= ~(HRTIMER_ADCEXTTRGA_ADC4TRG5);
            adcexttrga_reg |= ((triggercfg->trigger4_9 >> 5U) << 4U);
            HRTIMER_ADCEXTTRGA(hrtimer_periph) = adcexttrga_reg;
        }
        break;
        /* configure the ADC trigger 9 */
        case HRTIMER_ADCTRIG_9:
        {
            /* configure update source */
            adctrgupd &= (uint32_t)(~HRTIMER_ADCTRGUPD_ADTG9USRC);
            adctrgupd |= triggercfg->update_source << 20U;
            HRTIMER_ADCTRGUPD(hrtimer_periph) = adctrgupd;
            
            /* set the HRTIMER_ADCTRIG9 source */
            adcexttrg_reg = HRTIMER_ADCEXTTRG(hrtimer_periph);
            adcexttrg_reg &= ~(HRTIMER_ADCEXTTRG_ADC9TRG4_0);
            adcexttrg_reg |= ((triggercfg->trigger4_9 & 0x0000001FU) << 26U);
            HRTIMER_ADCEXTTRG(hrtimer_periph) = adcexttrg_reg;

            adcexttrga_reg = HRTIMER_ADCEXTTRGA(hrtimer_periph);
            adcexttrga_reg &= ~(HRTIMER_ADCEXTTRGA_ADC4TRG5);
            adcexttrga_reg |= ((triggercfg->trigger4_9 >> 5U) << 5U);
            HRTIMER_ADCEXTTRGA(hrtimer_periph) = adcexttrga_reg;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      configure the trigger source prescaler of ADC (0..9)
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  trigger_id: HRTIMER_ADCTRIG_y(y=0..9)
    \param[in]  psc: ADC trigger prescaler configuration struct (0x00~0x1F)
    \param[out] none
    \retval     none
*/
void hrtimer_adc_prescaler_config(uint32_t hrtimer_periph, uint32_t trigger_id, uint32_t psc)
{
    uint32_t adcpscr0;
    uint32_t adcpscr1;
    switch (trigger_id)
    {
        /* configure the ADC trigger 0 prescaler */
        case HRTIMER_ADCTRIG_0:
        {
            adcpscr0 = HRTIMER_ADCPSCR0(hrtimer_periph);
            adcpscr0 &= ~(HRTIMER_ADCPSCR0_ADC0PSC);
            adcpscr0 |= (psc);
            HRTIMER_ADCPSCR0(hrtimer_periph) = adcpscr0;
        }
        break;
        /* configure the ADC trigger 1 prescaler */
        case HRTIMER_ADCTRIG_1:
        {
            adcpscr0 = HRTIMER_ADCPSCR0(hrtimer_periph);
            adcpscr0 &= ~(HRTIMER_ADCPSCR0_ADC1PSC);
            adcpscr0 |= (psc << 6U);
            HRTIMER_ADCPSCR0(hrtimer_periph) = adcpscr0;
        }
        break;
        /* configure the ADC trigger 2 prescaler */
        case HRTIMER_ADCTRIG_2:
        {
            adcpscr0 = HRTIMER_ADCPSCR0(hrtimer_periph);
            adcpscr0 &= ~(HRTIMER_ADCPSCR0_ADC2PSC);
            adcpscr0 |= (psc << 12U);
            HRTIMER_ADCPSCR0(hrtimer_periph) = adcpscr0;
        }
        break;
        /* configure the ADC trigger 3 prescaler */
        case HRTIMER_ADCTRIG_3:
        {
            adcpscr0 = HRTIMER_ADCPSCR0(hrtimer_periph);
            adcpscr0 &= ~(HRTIMER_ADCPSCR0_ADC3PSC);
            adcpscr0 |= (psc << 18U);
            HRTIMER_ADCPSCR0(hrtimer_periph) = adcpscr0;
        }
        break;
        /* configure the ADC trigger 4 prescaler */
        case HRTIMER_ADCTRIG_4:
        {
            adcpscr0 = HRTIMER_ADCPSCR0(hrtimer_periph);
            adcpscr0 &= ~(HRTIMER_ADCPSCR0_ADC4PSC);
            adcpscr0 |= (psc << 24U);
            HRTIMER_ADCPSCR0(hrtimer_periph) = adcpscr0;
        }
        break;
        /* configure the ADC trigger 5 prescaler */
        case HRTIMER_ADCTRIG_5:
        {
            adcpscr1 = HRTIMER_ADCPSCR1(hrtimer_periph);
            adcpscr1 &= ~(HRTIMER_ADCPSCR1_ADC5PSC);
            adcpscr1 |= (psc);
            HRTIMER_ADCPSCR1(hrtimer_periph) = adcpscr1;
        }
        break;
        /* configure the ADC trigger 6 prescaler */
        case HRTIMER_ADCTRIG_6:
        {
            adcpscr1 = HRTIMER_ADCPSCR1(hrtimer_periph);
            adcpscr1 &= ~(HRTIMER_ADCPSCR1_ADC6PSC);
            adcpscr1 |= (psc << 6U);
            HRTIMER_ADCPSCR1(hrtimer_periph) = adcpscr1;
        }
        break;
        /* configure the ADC trigger 7 prescaler */
        case HRTIMER_ADCTRIG_7:
        {
            adcpscr1 = HRTIMER_ADCPSCR1(hrtimer_periph);
            adcpscr1 &= ~(HRTIMER_ADCPSCR1_ADC7PSC);
            adcpscr1 |= (psc << 12U);
            HRTIMER_ADCPSCR1(hrtimer_periph) = adcpscr1;
        }
        break;
        /* configure the ADC trigger 8 prescaler */
        case HRTIMER_ADCTRIG_8:
        {
            adcpscr1 = HRTIMER_ADCPSCR1(hrtimer_periph);
            adcpscr1 &= ~(HRTIMER_ADCPSCR1_ADC8PSC);
            adcpscr1 |= (psc << 18U);
            HRTIMER_ADCPSCR1(hrtimer_periph) = adcpscr1;
        }
        break;
        /* configure the ADC trigger 8 prescaler */
        case HRTIMER_ADCTRIG_9:
        {
            adcpscr1 = HRTIMER_ADCPSCR1(hrtimer_periph);
            adcpscr1 &= ~(HRTIMER_ADCPSCR1_ADC9PSC);
            adcpscr1 |= (psc << 24U);
            HRTIMER_ADCPSCR1(hrtimer_periph) = adcpscr1;
        }
        break;
        default:
        break;
    }
}

/*!
    \brief      get the Slave_TIMER counter direction
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[out] none
    \retval     DirectionStatus: COUNTER_UP or COUNTER_DOWN
*/
DirectionStatus hrtimer_slavetimer_counter_direction_get(uint32_t hrtimer_periph, uint32_t timer_id)
{
    DirectionStatus direction = COUNTER_UP;
    if(((HRTIMER_STXINTF(hrtimer_periph, timer_id) & HRTIMER_STXINTF_DIR) >> 31U) == COUNTER_UP){
        direction = COUNTER_UP;
    }else{
        direction = COUNTER_DOWN;
    }
    return direction;
}
/*!
    \brief      get the Master_TIMER and Slave_TIMER flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_MT_ST_FLAG_CMP0: compare 0 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_CMP1: compare 1 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_CMP2: compare 2 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_CMP3: compare 3 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_REP: repetition flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_FLAG_SYNI: synchronization input flag, for Master_TIMER
      \arg         HRTIMER_MT_ST_FLAG_UPD: update flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CAP0: capture 0 flag, for Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CAP1: capture 1 flag, for Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CH0OA: channel 0 output active flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH0ONA: channel 0 output inactive flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1OA: channel 1 output active flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1ONA: channel 1 output inactive flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CNTRST: counter reset flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_DLYIDLE: delayed IDLE mode entry flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CBLN: current balanced flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_BLNIDLE: balanced IDLE flag, for Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CH0OUTS: channel 0 output status flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1OUTS: channel 1 output status flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH0OUT: channel 0 output flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1OUT: channel 1 output flag, for Slave_TIMER 
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hrtimer_timers_flag_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t flag)
{
    FlagStatus flag_val = RESET;
    switch(timer_id)
    {
        /* get the Master_TIMER flag */
        case HRTIMER_MASTER_TIMER:
            if(RESET != (HRTIMER_MTINTF(hrtimer_periph) & flag)){
                flag_val = SET;
            }else{
                flag_val = RESET;
            }
        break;
        /* get the Slave_TIMER flag */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            if(RESET != (HRTIMER_STXINTF(hrtimer_periph, timer_id) & flag)){
                flag_val = SET;
            }else{
                flag_val = RESET;
            }
        break;
        
        default:
        break;  
    }
    return flag_val;
}

/*!
    \brief      clear the Master_TIMER and Slave_TIMER flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_MT_ST_FLAG_CMP0: compare 0 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_CMP1: compare 1 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_CMP2: compare 2 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_CMP3: compare 3 flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_FLAG_REP: repetition flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_FLAG_SYNI: synchronization input flag, for Master_TIMER
      \arg         HRTIMER_MT_ST_FLAG_UPD: update flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CAP0: capture 0 flag, for Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CAP1: capture 1 flag, for Slave_TIMER
      \arg         HRTIMER_ST_FLAG_CH0OA: channel 0 output active flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH0ONA: channel 0 output inactive flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1OA: channel 1 output active flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1ONA: channel 1 output inactive flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CNTRST: counter reset flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_DLYIDLE: delayed IDLE mode entry flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CBLN: current balanced flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_BLNIDLE: balanced IDLE flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH0OUTS: channel 0 output state flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1OUTS: channel 1 output state flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH0OUT: channel 0 output flag, for Slave_TIMER 
      \arg         HRTIMER_ST_FLAG_CH1OUT: channel 1 output flag, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void hrtimer_timers_flag_clear(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t flag)
{
    switch(timer_id)
    {
        /* clear the Master_TIMER flag */
        case HRTIMER_MASTER_TIMER:
            HRTIMER_MTINTC(hrtimer_periph) |= flag;
        break;
        /* clear the Slave_TIMER flag */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            HRTIMER_STXINTC(hrtimer_periph, timer_id) |= flag;
        break;
        default:
        break;
    }
}

/*!
    \brief      get the common interrupt flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_FLAG_FLT0: fault 0 flag
      \arg         HRTIMER_FLAG_FLT1: fault 1 flag
      \arg         HRTIMER_FLAG_FLT2: fault 2 flag
      \arg         HRTIMER_FLAG_FLT3: fault 3 flag
      \arg         HRTIMER_FLAG_FLT4: fault 4 flag
      \arg         HRTIMER_FLAG_FLT5: fault 5 flag
      \arg         HRTIMER_FLAG_FLT6: fault 6 flag
      \arg         HRTIMER_FLAG_FLT7: fault 7 flag
      \arg         HRTIMER_FLAG_SYSFLT: system fault flag
      \arg         HRTIMER_FLAG_DLLCAL: DLL calibration completed flag
      \arg         HRTIMER_FLAG_BMPER: bunch mode period flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hrtimer_common_flag_get(uint32_t hrtimer_periph, uint32_t flag)
{
    FlagStatus status = RESET;
    /* judge interrupt status */
    if(RESET != (HRTIMER_INTF(hrtimer_periph) & flag)){
        status = SET;
    }

