wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    return status;
}

/*!
    \brief      clear the common interrupt flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  flag: flag source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_FLAG_FLT0: fault 0 flag
      \arg         HRTIMER_FLAG_FLT1: fault 1 flag
      \arg         HRTIMER_FLAG_FLT2: fault 2 flag
      \arg         HRTIMER_FLAG_FLT3: fault 3 flag
      \arg         HRTIMER_FLAG_FLT4: fault 4 flag
      \arg         HRTIMER_FLAG_FLT5: fault 5 flag
      \arg         HRTIMER_FLAG_FLT6: fault 6 flag
      \arg         HRTIMER_FLAG_FLT7: fault 7 flag
      \arg         HRTIMER_FLAG_SYSFLT: system fault flag
      \arg         HRTIMER_FLAG_DLLCAL: DLL calibration completed flag
      \arg         HRTIMER_FLAG_BMPER: bunch mode period flag
    \param[out] none
    \retval     none
*/
void hrtimer_common_flag_clear(uint32_t hrtimer_periph, uint32_t flag)
{
    HRTIMER_INTC(hrtimer_periph) |= flag;
}

/*!
    \brief      enable the Master_TIMER and Slave_TIMER interrupt 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_MT_ST_INT_CMP0: compare 0 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_CMP1: compare 1 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_CMP2: compare 2 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_CMP3: compare 3 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_REP: repetition interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_INT_SYNI: synchronization input interrupt, for Master_TIMER
      \arg         HRTIMER_MT_ST_INT_UPD: update interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_ST_INT_CAP0: capture 0 interrupt, for Slave_TIMER
      \arg         HRTIMER_ST_INT_CAP1: capture 1 interrupt, for Slave_TIMER
      \arg         HRTIMER_ST_INT_CH0OA: channel 0 output active interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CH0ONA: channel 0 output inactive interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CH1OA: channel 1 output active interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CH1ONA: channel 1 output inactive interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CNTRST: counter reset interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_DLYIDLE: delayed IDLE mode entry interrupt, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void hrtimer_timers_interrupt_enable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    switch(timer_id)
    {
        /* enable the Master_TIMER interrupt */
        case HRTIMER_MASTER_TIMER:
            HRTIMER_MTDMAINTEN(hrtimer_periph) |= interrupt;
        break;
        /* enable the Slave_TIMER interrupt */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            HRTIMER_STXDMAINTEN(hrtimer_periph, timer_id) |= interrupt;
        break;
        
        default:
        break;  
    }
}
/*!
    \brief      disable the Master_TIMER and Slave_TIMER interrupt 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_MT_ST_INT_CMP0: compare 0 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_CMP1: compare 1 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_CMP2: compare 2 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_CMP3: compare 3 interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_REP: repetition interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_INT_SYNI: synchronization input interrupt, for Master_TIMER
      \arg         HRTIMER_MT_ST_INT_UPD: update interrupt, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_ST_INT_CAP0: capture 0 interrupt, for Slave_TIMER
      \arg         HRTIMER_ST_INT_CAP1: capture 1 interrupt, for Slave_TIMER
      \arg         HRTIMER_ST_INT_CH0OA: channel 0 output active interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CH0ONA: channel 0 output inactive interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CH1OA: channel 1 output active interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CH1ONA: channel 1 output inactive interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_CNTRST: counter reset interrupt, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_DLYIDLE: delayed IDLE mode entry interrupt, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void hrtimer_timers_interrupt_disable(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    switch(timer_id)
    {
        /* disable the Master_TIMER interrupt */
        case HRTIMER_MASTER_TIMER:
            HRTIMER_MTDMAINTEN(hrtimer_periph) &= ~interrupt;
        break;
        /* disable the Slave_TIMER interrupt */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            HRTIMER_STXDMAINTEN(hrtimer_periph, timer_id) &= ~interrupt;
        break;

        default:
        break;  
    }
}

/*!
    \brief      get the Master_TIMER and Slave_TIMER interrupt flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP0: compare 0 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP1: compare 1 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP2: compare 2 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP3: compare 3 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_REP: repetition interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_INT_FLAG_SYNI: synchronization input interrupt flag, for Master_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_UPD: update interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_ST_INT_FLAG_CAP0: capture 0 interrupt flag, for Slave_TIMER
      \arg         HRTIMER_ST_INT_FLAG_CAP1: capture 1 interrupt flag, for Slave_TIMER
      \arg         HRTIMER_ST_INT_FLAG_CH0OA: channel 0 output active interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CH0ONA: channel 0 output inactive interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CH1OA: channel 1 output active interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CH1ONA: channel 1 output inactive interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CNTRST: counter reset interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_DLYIDLE: delayed IDLE mode entry interrupt flag, for Slave_TIMER 
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hrtimer_timers_interrupt_flag_get(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    FlagStatus flag = RESET;
    uint32_t interflag = 0U;
    uint32_t interen = 0U;
    
