wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    switch(timer_id)
    {
        /* get the Master_TIMER interrupt flag */
        case HRTIMER_MASTER_TIMER:
            interflag = (HRTIMER_MTINTF(hrtimer_periph) & interrupt);
            interen = (HRTIMER_MTDMAINTEN(hrtimer_periph) & interrupt);
            if((RESET != interflag) && (RESET != interen)){
                flag = SET;
            }else{
                flag =  RESET;
            }
        break;
        /* get the Slave_TIMER interrupt flag */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            interflag = (HRTIMER_STXINTF(hrtimer_periph, timer_id) & interrupt);
            interen = (HRTIMER_STXDMAINTEN(hrtimer_periph, timer_id) & interrupt);
            if((RESET != interflag) && (RESET != interen)){
                flag =  SET;
            }else{
                flag =  RESET;
            }
        break;
        
        default:
        break;  
    }
    return flag;
}

/*!
    \brief      clear the Master_TIMER and Slave_TIMER interrupt flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_MASTER_TIMER, HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP0: compare 0 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP1: compare 1 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP2: compare 2 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_CMP3: compare 3 interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_REP: repetition interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_MT_INT_FLAG_SYNI: synchronization input interrupt flag, for Master_TIMER
      \arg         HRTIMER_MT_ST_INT_FLAG_UPD: update interrupt flag, for Master_TIMER and Slave_TIMER
      \arg         HRTIMER_ST_INT_FLAG_CAP0: capture 0 interrupt flag, for Slave_TIMER
      \arg         HRTIMER_ST_INT_FLAG_CAP1: capture 1 interrupt flag, for Slave_TIMER
      \arg         HRTIMER_ST_INT_FLAG_CH0OA: channel 0 output active interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CH0ONA: channel 0 output inactive interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CH1OA: channel 1 output active interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CH1ONA: channel 1 output inactive interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_CNTRST: counter reset interrupt flag, for Slave_TIMER 
      \arg         HRTIMER_ST_INT_FLAG_DLYIDLE: delayed IDLE mode entry interrupt flag, for Slave_TIMER 
    \param[out] none
    \retval     none
*/
void hrtimer_timers_interrupt_flag_clear(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t interrupt)
{
    switch(timer_id)
    {
        /* clear the Master_TIMER interrupt flag */
        case HRTIMER_MASTER_TIMER:
            HRTIMER_MTINTC(hrtimer_periph) |= interrupt;
        break;
        /* clear theSlave_TIMER interrupt flag */
        case HRTIMER_SLAVE_TIMER0:
        case HRTIMER_SLAVE_TIMER1:
        case HRTIMER_SLAVE_TIMER2:
        case HRTIMER_SLAVE_TIMER3:
        case HRTIMER_SLAVE_TIMER4:
        case HRTIMER_SLAVE_TIMER5:
        case HRTIMER_SLAVE_TIMER6:
        case HRTIMER_SLAVE_TIMER7:
            HRTIMER_STXINTC(hrtimer_periph, timer_id) |= interrupt;
        break;
        
        default:
        break;  
    }
}

/*!
    \brief      enable HRTIMER common interrupt 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_INT_FLT0 : fault 0 interrupt enable
      \arg         HRTIMER_INT_FLT1 : fault 1 interrupt enable
      \arg         HRTIMER_INT_FLT2 : fault 2 interrupt enable
      \arg         HRTIMER_INT_FLT3 : fault 3 interrupt enable
      \arg         HRTIMER_INT_FLT4 : fault 4 interrupt enable
      \arg         HRTIMER_INT_FLT5 : fault 5 interrupt enable
      \arg         HRTIMER_INT_FLT6 : fault 6 interrupt enable
      \arg         HRTIMER_INT_FLT7 : fault 7 interrupt enable
      \arg         HRTIMER_INT_SYSFLT: system fault interrupt
      \arg         HRTIMER_INT_DLLCAL: DLL calibration completed interrupt
      \arg         HRTIMER_INT_BMPER: bunch mode period interrupt
    \param[out] none
    \retval     none
*/
void hrtimer_common_interrupt_enable(uint32_t hrtimer_periph, uint32_t interrupt)
{
    HRTIMER_INTEN(hrtimer_periph) |= interrupt;
}

/*!
    \brief      disable HRTIMER common interrupt 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_INT_FLT0: fault 0 interrupt
      \arg         HRTIMER_INT_FLT1: fault 1 interrupt
      \arg         HRTIMER_INT_FLT2: fault 2 interrupt
      \arg         HRTIMER_INT_FLT3: fault 3 interrupt
      \arg         HRTIMER_INT_FLT4: fault 4 interrupt
      \arg         HRTIMER_INT_FLT5: fault 5 interrupt
      \arg         HRTIMER_INT_FLT6: fault 6 interrupt
      \arg         HRTIMER_INT_FLT7: fault 7 interrupt
      \arg         HRTIMER_INT_SYSFLT: system fault interrupt
      \arg         HRTIMER_INT_DLLCAL: DLL calibration completed interrupt
      \arg         HRTIMER_INT_BMPER: bunch mode period interrupt
    \param[out] none
    \retval     none
*/
void hrtimer_common_interrupt_disable(uint32_t hrtimer_periph, uint32_t interrupt)
{
    HRTIMER_INTEN(hrtimer_periph) &= ~interrupt;
}

/*!
    \brief      get the common interrupt flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_INT_FLAG_FLT0: fault 0 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT1: fault 1 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT2: fault 2 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT3: fault 3 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT4: fault 4 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT5: fault 5 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT6: fault 6 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT7: fault 7 interrupt flag
      \arg         HRTIMER_INT_FLAG_SYSFLT: system fault interrupt flag
      \arg         HRTIMER_INT_FLAG_DLLCAL: DLL calibration completed interrupt flag
      \arg         HRTIMER_INT_FLAG_BMPER: bunch mode period interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hrtimer_common_interrupt_flag_get(uint32_t hrtimer_periph, uint32_t interrupt)
{
    uint32_t interflag = 0U;
    uint32_t interen = 0U;
    FlagStatus status = RESET;

    /* get the interrupt correlation bit value */
    interflag = (HRTIMER_INTF(hrtimer_periph) & interrupt);
    interen = (HRTIMER_INTEN(hrtimer_periph) & interrupt);
    
    /* get the interrupt flag */
    if((RESET != interflag) && (RESET != interen)){
        status = SET;
    }

