wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    return status;

}

/*!
    \brief      clear the common interrupt flag
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  interrupt: interrupt source
                only one parameter can be selected which is shown as below:
      \arg         HRTIMER_INT_FLAG_FLT0: fault 0 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT1: fault 1 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT2: fault 2 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT3: fault 3 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT4: fault 4 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT5: fault 5 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT6: fault 6 interrupt flag
      \arg         HRTIMER_INT_FLAG_FLT7: fault 7 interrupt flag
      \arg         HRTIMER_INT_FLAG_SYSFLT: system fault interrupt flag
      \arg         HRTIMER_INT_FLAG_DLLCAL: DLL calibration completed interrupt flag
      \arg         HRTIMER_INT_FLAG_BMPER: bunch mode period interrupt flag
    \param[out] none
    \retval     none
*/
void hrtimer_common_interrupt_flag_clear(uint32_t hrtimer_periph, uint32_t interrupt)
{
    HRTIMER_INTC(hrtimer_periph) |= interrupt;
}

/*!
    \brief      configure Master_TIMER timer base 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  master_baseinit: HRTIMER time base parameters struct
                  period: period value, min value: 3*tHRTIMER_CK clock, max value: 0xFFFF - (1*tHRTIMER_CK)
                  repetitioncounter: the counter repetition value, 0x00~0xFF
                  prescaler: HRTIMER_PRESCALER_MULy(y=32,16,8,4,2),HRTIMER_PRESCALER_DIVy(y=1,2,4)
                  counter_mode: HRTIMER_COUNTER_MODE_CONTINOUS, HRTIMER_COUNTER_MODE_SINGLEPULSE, HRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE
    \param[out] none
    \retval     none
*/
static void master_timer_base_config(uint32_t hrtimer_periph, hrtimer_baseinit_parameter_struct* master_baseinit)
{
    /* set counter clock division */
    HRTIMER_MTCTL0(hrtimer_periph) &= (uint32_t) ~(HRTIMER_MTCTL0_CNTCKDIV2_0);
    HRTIMER_MTCTL0(hrtimer_periph) |= (uint32_t)((master_baseinit->prescaler) & CNTCKDIV2_0_MASK);

    /* set the counter operating mode */
    HRTIMER_MTCTL0(hrtimer_periph) &= (uint32_t) ~(HRTIMER_STXCTL0_CTNM | HRTIMER_STXCTL0_CNTRSTM);
    HRTIMER_MTCTL0(hrtimer_periph) |= (uint32_t)master_baseinit->counter_mode;
  
    /* set the period and repetition registers */
    HRTIMER_MTCAR(hrtimer_periph) = master_baseinit->period;
    HRTIMER_MTCREP(hrtimer_periph) = master_baseinit->repetitioncounter;
}

/*!
    \brief      configure Master_TIMER in waveform mode 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  master_timerinit: waveform mode initialization parameters
                  half_mode: HRTIMER_HALFMODE_DISABLED, HRTIMER_HALFMODE_ENABLED
                  alternate_mode: HRTIMER_ALTERNATE_MODE_DISABLED,HRTIMER_ALTERNATE_MODE_TRIPLE,HRTIMER_ALTERNATE_MODE_QUAD
                  start_sync: HRTIMER_SYNISTART_DISABLED, HRTIMER_SYNISTART_ENABLED
                  reset_sync: HRTIMER_SYNCRESET_DISABLED, HRTIMER_SYNCRESET_ENABLED
                  dac_trigger: HRTIMER_DAC_TRIGGER_NONE, HRTIMER_DAC_TRIGGER_DACTRIGy(y=0..2)
                  shadow: HRTIMER_SHADOW_DISABLED, HRTIMER_SHADOW_ENABLED
                  update_selection: HRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT, HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE, HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE_UPDATE
                  cnt_bunch: HRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK, HRTIMER_TIMERBUNCHMODE_RESETCOUNTER
                  repetition_update: HRTIMER_UPDATEONREPETITION_DISABLED, HRTIMER_UPDATEONREPETITION_ENABLED
    \param[out] none
    \retval     none
*/
static void master_timer_waveform_config(uint32_t hrtimer_periph, hrtimer_timerinit_parameter_struct * master_timerinit)
{
    uint32_t mtctl0_reg;
    uint32_t bmctl_reg;

    mtctl0_reg = HRTIMER_MTCTL0(hrtimer_periph);
    bmctl_reg = HRTIMER_BMCTL(hrtimer_periph);
  
    /* configure the half mode */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_HALFM);
    mtctl0_reg |= master_timerinit->half_mode;
  
    /* configure the alternate mode */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_ALTM);
    mtctl0_reg |= (master_timerinit->alternate_mode >> 1);
  
    /* configure synchronization input start counter */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_SYNISTRT);
    mtctl0_reg |= master_timerinit->start_sync;
 
    /* configure synchronization input reset counter */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_SYNIRST);
    mtctl0_reg |= master_timerinit->reset_sync;
  
    /* configure trigger source to DAC */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_DACTRGS);
    mtctl0_reg |= master_timerinit->dac_trigger;
  
    /* enable/disable shadow registers */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_SHWEN);
    mtctl0_reg |= master_timerinit->shadow;
  
    /* update event selection */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_UPSEL);
    mtctl0_reg |= (master_timerinit->update_selection << 2);
  
    /* enable/disable registers update on repetition event */
    mtctl0_reg &= ~(uint32_t)(HRTIMER_MTCTL0_UPREP);
    mtctl0_reg |= (master_timerinit->repetition_update);
  
    /* set the timer bunch mode */
    bmctl_reg &= ~(HRTIMER_BMCTL_BMMT);
    bmctl_reg |= master_timerinit->cnt_bunch;

    HRTIMER_MTCTL0(hrtimer_periph) = mtctl0_reg;
    HRTIMER_BMCTL(hrtimer_periph) = bmctl_reg;
}

/*!
    \brief      configure Slave_TIMER timer base 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  slave_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  slave_baseinit: HRTIMER time base parameters struct
                  period: period value, min value: 3*tHRTIMER_CK clock, max value: 0xFFFF - (1*tHRTIMER_CK)
                  repetitioncounter: the counter repetition value, 0x00~0xFF
                  prescaler: HRTIMER_PRESCALER_MULy(y=32,16,8,4,2),HRTIMER_PRESCALER_DIVy(y=1,2,4)
                  counter_mode: HRTIMER_COUNTER_MODE_CONTINOUS, HRTIMER_COUNTER_MODE_SINGLEPULSE, HRTIMER_COUNTER_MODE_SINGLEPULSE_RETRIGGERABLE
                  counterdirection: HRTIMER_COUNTER_UP,HRTIMER_COUNTER_CENTER_ALIGNED
    \param[out] none
    \retval     none
*/
static void slave_timer_base_config(uint32_t hrtimer_periph, uint32_t slave_id, hrtimer_baseinit_parameter_struct* slave_baseinit)
{
    /* set counter clock division */
    HRTIMER_STXCTL0(hrtimer_periph, slave_id) &= (uint32_t) ~(HRTIMER_MTCTL0_CNTCKDIV2_0);
    HRTIMER_STXCTL0(hrtimer_periph, slave_id) |= (uint32_t)((slave_baseinit->prescaler) & CNTCKDIV2_0_MASK);

