wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
    /* set the counter operating mode */
    HRTIMER_STXCTL0(hrtimer_periph, slave_id) &= (uint32_t) ~(HRTIMER_STXCTL0_CTNM | HRTIMER_STXCTL0_CNTRSTM);
    HRTIMER_STXCTL0(hrtimer_periph, slave_id) |= (uint32_t)slave_baseinit->counter_mode;
  
    /* set the period and repetition registers */
    HRTIMER_STXCTL1(hrtimer_periph, slave_id) &= (uint32_t) ~(HRTIMER_STXCTL1_CAM);
    HRTIMER_STXCTL1(hrtimer_periph, slave_id) |= slave_baseinit->counterdirection;
    
    /* set the period and repetition registers */
    HRTIMER_STXCAR(hrtimer_periph, slave_id) = slave_baseinit->period;
    HRTIMER_STXCREP(hrtimer_periph, slave_id) = slave_baseinit->repetitioncounter;
}

/*!
    \brief      configure Slave_TIMER in waveform mode 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  slave_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  slave_timerinit: waveform mode initialization parameters
                  half_mode: HRTIMER_HALFMODE_DISABLED, HRTIMER_HALFMODE_ENABLED
                  alternate_mode: HRTIMER_ALTERNATE_MODE_DISABLED,HRTIMER_ALTERNATE_MODE_TRIPLE,HRTIMER_ALTERNATE_MODE_QUAD
                  start_sync: HRTIMER_SYNISTART_DISABLED, HRTIMER_SYNISTART_ENABLED
                  reset_sync: HRTIMER_SYNCRESET_DISABLED, HRTIMER_SYNCRESET_ENABLED
                  dac_trigger: HRTIMER_DAC_TRIGGER_NONE, HRTIMER_DAC_TRIGGER_DACTRIGy(y=0..2)
                  shadow: HRTIMER_SHADOW_DISABLED, HRTIMER_SHADOW_ENABLED
                  update_selection: HRTIMER_MT_ST_UPDATE_SELECTION_INDEPENDENT, for Master_TIMER and Slave_TIMER
                                    HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE,  for Master_TIMER and Slave_TIMER
                                    HRTIMER_MT_ST_UPDATE_SELECTION_DMAMODE_UPDATE, for Master_TIMER and Slave_TIMER
                                    HRTIMER_ST_UPDATE_SELECTION_STXUPINy(y=0..2), for Slave_TIMER
                                    HRTIMER_ST_UPDATE_SELECTION_STXUPINy_UPDATE(y=0..2), for Slave_TIMER
                  cnt_bunch: HRTIMER_TIMERBUNCHNMODE_MAINTAINCLOCK, HRTIMER_TIMERBUNCHMODE_RESETCOUNTER
                  repetition_update: HRTIMER_UPDATEONREPETITION_DISABLED, HRTIMER_UPDATEONREPETITION_ENABLED
                  resynchronized_update:HRTIMER_RSYUPD_DISABLED,HRTIMER_RSYUPD_ENABLED
    \param[out] none
    \retval     none
*/
static void slave_timer_waveform_config(uint32_t hrtimer_periph, uint32_t slave_id, hrtimer_timerinit_parameter_struct * slave_timerinit)
{
    uint32_t stxctl0_reg;
    uint32_t bmctl_reg;

    stxctl0_reg = HRTIMER_STXCTL0(hrtimer_periph, slave_id);
    bmctl_reg = HRTIMER_BMCTL(hrtimer_periph);
  
    /* configure the half mode */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_HALFM);
    stxctl0_reg |= slave_timerinit->half_mode;

    /* configure the alternate mode */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_ALTM);
    stxctl0_reg |= slave_timerinit->alternate_mode;
  
    /* configure the Re-synchronized update mode */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_RSYNUPD);
    stxctl0_reg |= slave_timerinit->resynchronized_update;
  
    /* configure synchronization input start counter */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_SYNISTRT);
    stxctl0_reg |= slave_timerinit->start_sync;
 
    /* configure synchronization input reset counter */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_SYNIRST);
    stxctl0_reg |= slave_timerinit->reset_sync;
  
    /* configure trigger source to DAC */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_DACTRGS);
    stxctl0_reg |= slave_timerinit->dac_trigger;
  
    /* enable/disable shadow registers */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_SHWEN);
    stxctl0_reg |= slave_timerinit->shadow;
  
    /* update event selection */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_UPSEL);
    stxctl0_reg |= (slave_timerinit->update_selection);
  
    /* enable/disable registers update on repetition event */
    stxctl0_reg &= ~(uint32_t)(HRTIMER_STXCTL0_UPREP);
    if(HRTIMER_UPDATEONREPETITION_ENABLED == slave_timerinit->repetition_update){
        stxctl0_reg |= (HRTIMER_STXCTL0_UPREP);
    }
    
    /* Set the timer bunch mode */
    switch (slave_id)
    {
        case HRTIMER_SLAVE_TIMER0:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST0);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 1);
        }
        break;
        case HRTIMER_SLAVE_TIMER1:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST1);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 2);
        }
        break;
        case HRTIMER_SLAVE_TIMER2:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST2);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 3);
        }
        break;
        case HRTIMER_SLAVE_TIMER3:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST3);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 4);
        }
        break;
        case HRTIMER_SLAVE_TIMER4:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST4);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 5);
        }
        break;
        case HRTIMER_SLAVE_TIMER5:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST5);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 6);
        }
        break;
        case HRTIMER_SLAVE_TIMER6:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST6);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 7);
        }
        break;
        case HRTIMER_SLAVE_TIMER7:
        {
            bmctl_reg &= ~(HRTIMER_BMCTL_BMST7);
            bmctl_reg |= (slave_timerinit->cnt_bunch << 8);
        }
        break;
        default:
        break;
    }

    HRTIMER_STXCTL0(hrtimer_periph, slave_id) = stxctl0_reg;
    HRTIMER_BMCTL(hrtimer_periph) = bmctl_reg;
}

/*!
    \brief      configure the an external event channel
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  event_id: HRTIMER_EXEVENT_NONE, HRTIMER_EXEVENT_y(y=0..9)
    \param[in]  eventcfg: external event configuration struct
                  source: HRTIMER_EXEV_SRCy(y=0..3)
                  polarity: HRTIMER_EXEV_POLARITY_HIGH, HRTIMER_EXEV_POLARITY_LOW
                  edge: HRTIMER_EXEV_EDGE_LEVEL, HRTIMER_EXEV_EDGE_RISING, HRTIMER_EXEV_EDGE_FALLING, HRTIMER_EXEV_EDGE_BOTH
                  fast:HRTIMER_EXEV_FAST_DISABLE,HRTIMER_EXEV_FAST_ENABLE
                  digital_filter: 0x0~0xF
    \param[out] none
    \retval     none
*/
static void external_event_config(uint32_t hrtimer_periph, uint32_t event_id, hrtimer_exeventcfg_parameter_struct* eventcfg)
{
    uint32_t exevcfg0_reg;
    uint32_t exevcfg1_reg;
    uint32_t exevdfctl_reg;

    exevcfg0_reg = HRTIMER_EXEVCFG0(hrtimer_periph);
    exevcfg1_reg = HRTIMER_EXEVCFG1(hrtimer_periph);
    exevdfctl_reg = HRTIMER_EXEVDFCTL(hrtimer_periph);
  
    switch (event_id)
    {
        case HRTIMER_EXEVENT_0:
        {
            /* configure external event 0 */
            exevcfg0_reg &= ~(HRTIMER_EXEVCFG0_EXEV0SRC | HRTIMER_EXEVCFG0_EXEV0P | HRTIMER_EXEVCFG0_EXEV0EG|HRTIMER_EXEVCFG0_EXEV0FAST);
            exevcfg0_reg |= eventcfg->source;
            exevcfg0_reg |= eventcfg->polarity;
            exevcfg0_reg |= eventcfg->edge;
            exevcfg0_reg |= eventcfg->fast;
            HRTIMER_EXEVCFG0(hrtimer_periph) = exevcfg0_reg;
        }
        break;
        case HRTIMER_EXEVENT_1:
        {
            /* configure external event 1 */
            exevcfg0_reg &= ~(HRTIMER_EXEVCFG0_EXEV1SRC | HRTIMER_EXEVCFG0_EXEV1P | HRTIMER_EXEVCFG0_EXEV1EG|HRTIMER_EXEVCFG0_EXEV1FAST);
            exevcfg0_reg |= ((eventcfg->source) << 6U);
            exevcfg0_reg |= ((eventcfg->polarity) << 6U);
            exevcfg0_reg |= ((eventcfg->edge) << 6U);
            exevcfg0_reg |= ((eventcfg->fast) << 6U);
            HRTIMER_EXEVCFG0(hrtimer_periph) = exevcfg0_reg;
        }
        break;
        case HRTIMER_EXEVENT_2:
        {
            /* configure external event 2 */
            exevcfg0_reg &= ~(HRTIMER_EXEVCFG0_EXEV2SRC | HRTIMER_EXEVCFG0_EXEV2P | HRTIMER_EXEVCFG0_EXEV2EG|HRTIMER_EXEVCFG0_EXEV2FAST);
            exevcfg0_reg |= ((eventcfg->source) << 12U);
            exevcfg0_reg |= ((eventcfg->polarity) << 12U);
            exevcfg0_reg |= ((eventcfg->edge) << 12U);
            exevcfg0_reg |= ((eventcfg->fast) << 12U);
            HRTIMER_EXEVCFG0(hrtimer_periph) = exevcfg0_reg;
        }
        break;
        case HRTIMER_EXEVENT_3:
        {
            /* configure external event 3 */
            exevcfg0_reg &= ~(HRTIMER_EXEVCFG0_EXEV3SRC | HRTIMER_EXEVCFG0_EXEV3P | HRTIMER_EXEVCFG0_EXEV3EG|HRTIMER_EXEVCFG0_EXEV3FAST);
            exevcfg0_reg |= ((eventcfg->source) << 18U);
            exevcfg0_reg |= ((eventcfg->polarity) << 18U);
            exevcfg0_reg |= ((eventcfg->edge) << 18U);
            exevcfg0_reg |= ((eventcfg->fast) << 18U);
            HRTIMER_EXEVCFG0(hrtimer_periph) = exevcfg0_reg;
        }
        break;
        case HRTIMER_EXEVENT_4:
        {
            /* configure external event 4 */
            exevcfg0_reg &= ~(HRTIMER_EXEVCFG0_EXEV4SRC | HRTIMER_EXEVCFG0_EXEV4P | HRTIMER_EXEVCFG0_EXEV4EG|HRTIMER_EXEVCFG0_EXEV4FAST);
            exevcfg0_reg |= ((eventcfg->source) << 24U);
            exevcfg0_reg |= ((eventcfg->polarity) << 24U);
            exevcfg0_reg |= ((eventcfg->edge) << 24U);
            exevcfg0_reg |= ((eventcfg->fast) << 24U);
            HRTIMER_EXEVCFG0(hrtimer_periph) = exevcfg0_reg;
        }
        break;
        case HRTIMER_EXEVENT_5:
        {
            /* configure external event 5 */
            exevcfg1_reg &= ~(HRTIMER_EXEVCFG1_EXEV5SRC | HRTIMER_EXEVCFG1_EXEV5P | HRTIMER_EXEVCFG1_EXEV5EG);
            exevcfg1_reg |= (eventcfg->source);
            exevcfg1_reg |= (eventcfg->polarity);
            exevcfg1_reg |= (eventcfg->edge);
            exevdfctl_reg &= ~(HRTIMER_EXEVDFCTL_EXEV5FC);
            exevdfctl_reg |= (eventcfg->digital_filter);
            HRTIMER_EXEVCFG1(hrtimer_periph) = exevcfg1_reg;
            HRTIMER_EXEVDFCTL(hrtimer_periph) = exevdfctl_reg;
        }
        break;
        case HRTIMER_EXEVENT_6:
        {
            /* configure external event 6 */
            exevcfg1_reg &= ~(HRTIMER_EXEVCFG1_EXEV6SRC | HRTIMER_EXEVCFG1_EXEV6P | HRTIMER_EXEVCFG1_EXEV6EG);
            exevcfg1_reg |= ((eventcfg->source) << 6U);
            exevcfg1_reg |= ((eventcfg->polarity) << 6U);
            exevcfg1_reg |= ((eventcfg->edge) << 6U);
            exevdfctl_reg &= ~(HRTIMER_EXEVDFCTL_EXEV6FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 6U);
            HRTIMER_EXEVCFG1(hrtimer_periph) = exevcfg1_reg;
            HRTIMER_EXEVDFCTL(hrtimer_periph) = exevdfctl_reg;
        }
        break;
        case HRTIMER_EXEVENT_7:
        {
            /* configure external event 7 */
            exevcfg1_reg &= ~(HRTIMER_EXEVCFG1_EXEV7SRC | HRTIMER_EXEVCFG1_EXEV7P | HRTIMER_EXEVCFG1_EXEV7EG);
            exevcfg1_reg |= ((eventcfg->source) << 12U);
            exevcfg1_reg |= ((eventcfg->polarity) << 12U);
            exevcfg1_reg |= ((eventcfg->edge) << 12U);
            exevdfctl_reg &= ~(HRTIMER_EXEVDFCTL_EXEV7FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 12U);
            HRTIMER_EXEVCFG1(hrtimer_periph) = exevcfg1_reg;
            HRTIMER_EXEVDFCTL(hrtimer_periph) = exevdfctl_reg;
        }
        break;
        case HRTIMER_EXEVENT_8:
        {
            /* configure external event 8 */
            exevcfg1_reg &= ~(HRTIMER_EXEVCFG1_EXEV8SRC | HRTIMER_EXEVCFG1_EXEV8P | HRTIMER_EXEVCFG1_EXEV8EG);
            exevcfg1_reg |= ((eventcfg->source) << 18U);
            exevcfg1_reg |= ((eventcfg->polarity) << 18U);
            exevcfg1_reg |= ((eventcfg->edge) << 18U);
            exevdfctl_reg &= ~(HRTIMER_EXEVDFCTL_EXEV8FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 18U);
            HRTIMER_EXEVCFG1(hrtimer_periph) = exevcfg1_reg;
            HRTIMER_EXEVDFCTL(hrtimer_periph) = exevdfctl_reg;
        }
        break;
        case HRTIMER_EXEVENT_9:
        {
            /* configure external event 9 */
            exevcfg1_reg &= ~(HRTIMER_EXEVCFG1_EXEV9SRC | HRTIMER_EXEVCFG1_EXEV9P | HRTIMER_EXEVCFG1_EXEV9EG);
            exevcfg1_reg |= ((eventcfg->source) << 24U);
            exevcfg1_reg |= ((eventcfg->polarity) << 24U);
            exevcfg1_reg |= ((eventcfg->edge) << 24U);
            exevdfctl_reg &= ~(HRTIMER_EXEVDFCTL_EXEV9FC);
            exevdfctl_reg |= ((eventcfg->digital_filter) << 24U);
            HRTIMER_EXEVCFG1(hrtimer_periph) = exevcfg1_reg;
            HRTIMER_EXEVDFCTL(hrtimer_periph) = exevdfctl_reg;
        }
        break;
        default:
        break;
    }
}


/*!
    \brief      configure the channel output 
    \param[in]  hrtimer_periph: HRTIMER0
    \param[in]  timer_id: HRTIMER_SLAVE_TIMERx(x=0..7)
    \param[in]  channel: HRTIMER_STx_CHy(x=0..7,y=0,1)
    \param[in]  outcfg: channel output configuration struct definitions
                  polarity: HRTIMER_CHANNEL_POLARITY_HIGH, HRTIMER_CHANNEL_POLARITY_LOW
                  set_request: HRTIMER_CHANNEL_SET_NONE, HRTIMER_CHANNEL_SET_RSTSYNI, HRTIMER_CHANNEL_SET_PER, HRTIMER_CHANNEL_SET_CMPy(y=0..3),
                               HRTIMER_CHANNEL_SET_MTPER, HRTIMER_CHANNEL_SET_MTCMPy(y=0..3), HRTIMER_CHANNEL_SET_STEVy(y=0..8), HRTIMER_CHANNELx_SET_STEVy(x=0,1,y=9,10),
                               HRTIMER_CHANNEL_SET_EXEVy(y=0..9), HRTIMER_CHANNEL_SET_UPDATE, HRTIMER_CHANNELx_SET_STCNTRST(x=0,1)
                  reset_request: HRTIMER_CHANNEL_RESET_NONE, HRTIMER_CHANNEL_RESET_RSTSYNI, HRTIMER_CHANNEL_RESET_PER, HRTIMER_CHANNEL_RESET_CMPy(y=0..3),
                               HRTIMER_CHANNEL_RESET_MTPER, HRTIMER_CHANNEL_RESET_MTCMPy(y=0..3), HRTIMER_CHANNEL_RESET_STEVy(y=0..8), HRTIMER_CHANNELx_RESET_STEVy(x=0,1,y=9,10),
                               HRTIMER_CHANNEL_RESET_EXEVy(y=0..9), HRTIMER_CHANNEL_RESET_UPDATE, HRTIMER_CHANNELx_RESET_STCNTRST(x=0,1)
                  idle_bunch: HRTIMER_CHANNEL_BUNCH_IDLE_DISABLE, HRTIMER_CHANNEL_BUNCH_IDLE_ENABLE
                  idle_state: HRTIMER_CHANNEL_IDLESTATE_INACTIVE, HRTIMER_CHANNEL_IDLESTATE_ACTIVE
                  fault_state: HRTIMER_CHANNEL_FAULTSTATE_NONE, HRTIMER_CHANNEL_FAULTSTATE_ACTIVE, HRTIMER_CHANNEL_FAULTSTATE_INACTIVE, HRTIMER_CHANNEL_FAULTSTATE_HIGHZ
                  carrier_mode: HRTIMER_CHANNEL_CARRIER_DISABLED, HRTIMER_CHANNEL_CARRIER_ENABLED
                  deadtime_bunch: HRTIMER_CHANNEL_BUNCH_ENTRY_REGULAR, HRTIMER_CHANNEL_BUNCH_ENTRY_DEADTIME
    \param[out] none
    \retval     none
*/
static void channel_output_config(uint32_t hrtimer_periph, uint32_t timer_id, uint32_t channel, hrtimer_channel_outputcfg_parameter_struct * outcfg)
{
    uint32_t stxchoctl_reg;
    uint32_t stxcntrsta_reg; 
    uint32_t shift = 0U;
  
    stxchoctl_reg = HRTIMER_STXCHOCTL(hrtimer_periph, timer_id);
    /* configure the output set/reset crossbar */
    switch (channel)
    {
        case HRTIMER_ST0_CH0:
        case HRTIMER_ST1_CH0:
        case HRTIMER_ST2_CH0:
        case HRTIMER_ST3_CH0:
        case HRTIMER_ST4_CH0:
        case HRTIMER_ST5_CH0:
        case HRTIMER_ST6_CH0:
        case HRTIMER_ST7_CH0:
        {
            shift = 0U;
            /* configure the output set request in HRTIMER_STXCH0SET register */
            HRTIMER_STXCH0SET(hrtimer_periph, timer_id) = (uint32_t)(outcfg->set_request);
            /* configure the output set request in HRTIMER_STXCNTRSTA register */
            stxcntrsta_reg = HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id);
            stxcntrsta_reg &= ~0x00130000U;
            stxcntrsta_reg |= (uint32_t)(outcfg->set_request >> 32U);
            HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id) = stxcntrsta_reg;

            /* configure the output reset request in HRTIMER_STXCH0RESET register */
            HRTIMER_STXCH0RST(hrtimer_periph, timer_id) = (uint32_t)(outcfg->reset_request);
            /* configure the output reset request in HRTIMER_STXCNTRSTA register */
            stxcntrsta_reg = HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id);
            stxcntrsta_reg &= ~0x13000000U;
            stxcntrsta_reg |= (uint32_t)(outcfg->reset_request >> 32U);
            HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id) = stxcntrsta_reg;
        }
        break;
        case HRTIMER_ST0_CH1:
        case HRTIMER_ST1_CH1:
        case HRTIMER_ST2_CH1:
        case HRTIMER_ST3_CH1:
        case HRTIMER_ST4_CH1:
        case HRTIMER_ST5_CH1:
        case HRTIMER_ST6_CH1:
        case HRTIMER_ST7_CH1:
        {
            shift = 16U;
            /* configure the output set request in HRTIMER_STXCH1SET register */
            HRTIMER_STXCH1SET(hrtimer_periph, timer_id) = (uint32_t)(outcfg->set_request);
            /* configure the output set request in HRTIMER_STXCNTRSTA register */
            stxcntrsta_reg = HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id);
            stxcntrsta_reg &= ~0x002C0000U;
            stxcntrsta_reg |= (uint32_t)(outcfg->set_request >> 32U);
            HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id) = stxcntrsta_reg;

