wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_hrtimer.c
            /* configure the output reset request in HRTIMER_STXCH1RESET register */
            HRTIMER_STXCH1RST(hrtimer_periph, timer_id) = (uint32_t)(outcfg->reset_request);
            /* configure the output reset request in HRTIMER_STXCNTRSTA register */
            stxcntrsta_reg = HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id);
            stxcntrsta_reg &= ~0x2C000000U;
            stxcntrsta_reg |= (uint32_t)(outcfg->reset_request >> 32U);
            HRTIMER_STXCNTRSTA(hrtimer_periph, timer_id) = stxcntrsta_reg;
        }
        break;
        default:
        break;
    }
    /* clear output config */
    stxchoctl_reg &= ~((HRTIMER_STXCHOCTL_CH0P | HRTIMER_STXCHOCTL_BMCH0IEN | HRTIMER_STXCHOCTL_ISO0 | HRTIMER_STXCHOCTL_CH0FLTOS|\
                     HRTIMER_STXCHOCTL_CH0CSEN | HRTIMER_STXCHOCTL_BMCH0DTI)  << shift);
    
    /* config the polarity */
    stxchoctl_reg |= (outcfg->polarity << shift);
  
    /* channel IDLE enable state config in bunch mode */
    stxchoctl_reg |= (outcfg->idle_bunch << shift);
    
    /* config channel output IDLE state */
    stxchoctl_reg |= (outcfg->idle_state << shift);
    
    /* config the FAULT output state */
    stxchoctl_reg |= (outcfg->fault_state << shift);
    
    /* config the channel carrier-signal mode enable state */
    stxchoctl_reg |= (outcfg->carrier_mode << shift);

    /* config channel dead-time insert in bunch mode */
    stxchoctl_reg |= (outcfg->deadtime_bunch << shift);
  
    HRTIMER_STXCHOCTL(hrtimer_periph, timer_id) = stxchoctl_reg;
}
